[
  {
    "content": "A ring \\( R \\) has \\((A_n)\\) if each ideal \\( I \\subseteq Z(R) \\) that can be generated by \\( n \\) (or fewer) elements has a nonzero annihilator. An alternate restriction on zero divisors is \\((a.c.)\\): \\( R \\) has \\((a.c.)\\) if for each pair of elements \\( r, s \\in R \\), there is an element \\( t \\in R \\) such that \\( \text{Ann}(r, s) = \text{Ann}(t) \\).There does not exist a reduced ring that have both \\((a.c.)\\) and \\((A_n)\\) for some \\( n \\geq 2 \\) that are not McCoy rings.",
    "research": "## Executive Summary  \n**Conjecture (Lucas’s Annihilator Conjecture)** – *If a ring is reduced and satisfies the two “annihilator conditions” (property $(A_n)$ for some $n\\ge 2$ and property $(a.c.)$), then it must be a McCoy ring.* In other words, no *reduced* ring outside the McCoy class is known to simultaneously have property $(a.c.)$ and $(A_n)$ for $n\\ge 2$. This conjecture remains **open**: it has neither been proven in full generality nor refuted by a counterexample as of the latest literature. Partial evidence strongly supports it – for example, all commutative rings (in fact **all** commutative rings are McCoy by McCoy’s 1942 theorem ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=McCoy%20proved%20in%201942%C2%A0,author%20made%20the%20following%20definition))) and many well-behaved noncommutative rings satisfy the conjecture – but no one has constructed a “wild” reduced ring that violates it. It stands as a guiding question in the theory of zero-divisor restrictions and polynomial zero-divisor behavior.\n\n## Historical Context  \nThe conditions $(A_n)$ and $(a.c.)$ were introduced by **T. G. Lucas** in 1986 ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=T,193%20View%20PDFView%20articleView%20in)). Lucas’s paper “Two annihilator conditions: property (A) and (a.c.)” formalized these concepts to study commutative-like restrictions on zero divisors in possibly noncommutative rings. The motivation was to understand rings in which zero divisors are *not* “too wild” – a theme arising in earlier works on *symmetric rings* and *reversible rings* (e.g. work of G. Shin on “pseudo-symmetric” rings in the 1970s). By imposing annihilator conditions, Lucas aimed to characterize rings that behave in a controlled way reminiscent of commutative rings or rings decomposed into direct sums of domains.  \n\nNot long after Lucas’s work, interest grew in how these annihilator conditions interact with **McCoy’s Theorem** (1942) on polynomial zero divisors. McCoy’s theorem is a classical result stating that over any commutative base ring $R$, if two polynomials $f,g\\in R[x]$ satisfy $f\\cdot g = 0$, then each polynomial has a nonzero annihilator in $R$ ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=McCoy%20proved%20in%201942%C2%A0,author%20made%20the%20following%20definition)). In modern terms, *every commutative ring is a McCoy ring*. The natural question in the noncommutative setting was: *if a ring’s zero divisors already satisfy strong conditions like (A) or (a.c.), does that force the ring to be McCoy?* This conjecture emerged gradually through the late 1990s and early 2000s as ring theorists (notably C. Y. **Hong**, N. K. **Kim**, T. K. **Kwak**, Y. **Lee**, and others) studied examples of rings that are “close” to commutative. By 2005, Hong–Kim–Kwak–Lee had examined these conditions in various noncommutative rings (e.g. *symmetric rings, semicommutative rings, duo rings*) and observed that whenever a reduced ring had both property (A) and (a.c.), it invariably also satisfied McCoy’s condition in all known cases ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20investigate%20relations%20between%20the,infinite%29%20matrix%20constructions)). The conjecture was explicitly posed in this form in discussions and papers around 2007–2008, when researchers like V. **Camillo** and P. **Nielsen** compiled implication diagrams relating many ring properties (Armendariz, semicommutative, reversible, etc.) to the McCoy property ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=The%20implication%20chart%20we%20gave,few%20conditions%20from%20our%20chart)) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20thank%20C,0602242)). The nonexistence of a counterexample became an open problem flagged by experts (Hong–Kim and others) and remains unanswered today.\n\n## Mathematical Analysis  \n\n### Definitions of Key Terms  \n- **Property $(A_n)$:** A ring $R$ has $(A_n)$ if *every ideal* $I\\subseteq Z(R)$ that can be generated by $n$ or fewer elements has a nonzero annihilator. Here $Z(R)$ denotes the set of zero divisors of $R$. Intuitively, no small collection of zero divisors is “unavoidable” – for any $n$ (or fewer) zero divisors $a_1,\\dots,a_n$, there exists a nonzero $r\\in R$ such that $r\\cdot a_i = 0$ for all $i=1,\\dots,n$. For example, $(A_1)$ means every *single* zero divisor $a$ has a nonzero annihilator (some nonzero $r$ with $ra=0$), $(A_2)$ means any *pair* of zero divisors has a common nonzero annihilator, etc. **Property $(A)$** (with no subscript) usually refers to this condition for *all finitely generated* ideals of $Z(R)$ ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=T,193%20View%20PDFView%20articleView%20in)) (i.e. $(A_n)$ holds for every finite $n$). A ring with $(A)$ is sometimes called an *annihilator ring* in the sense that finite sets of zero divisors can be “annihilated” by a single element.  \n  \n- **Property $(a.c.)$ (Annihilator-closure):** A ring $R$ has $(a.c.)$ if for *each pair* of elements $r,s\\in R$, the *intersection* of their individual annihilators is itself the annihilator of some element of $R$. In notation: for every $r,s\\in R$, there exists $t\\in R$ such that \n  $$\\mathrm{Ann}(r,s) \\;=\\; \\mathrm{Ann}(t),$$ \n  where $\\mathrm{Ann}(r,s)=\\{x\\in R \\mid x r = x s = 0\\}$ and $\\mathrm{Ann}(t)=\\{x\\in R \\mid x t = 0\\}$. This property says that any common annihilator of two elements is “principal” (generated by one element’s annihilator). In a commutative ring, $\\mathrm{Ann}(r,s)=\\mathrm{Ann}(r)\\cap\\mathrm{Ann}(s)$, so $(a.c.)$ means the intersection of any two principal annihilator ideals is again a principal annihilator ideal. For example, if $R$ has $(a.c.)$ and $a,b\\in R$, one can find some $t$ with $\\mathrm{Ann}(a)\\cap\\mathrm{Ann}(b)=\\mathrm{Ann}(t)$. Property $(a.c.)$ is a strong restriction on the structure of zero divisors – it implies a high degree of order in the lattice of ideals generated by zero divisors.  \n  \n- **McCoy Ring:** A ring $R$ (not necessarily commutative) is called a *McCoy ring* if whenever two polynomials $f(x),g(x)\\in R[x]$ (with $R[x]$ the polynomial ring in one indeterminate) satisfy $f(x)\\,g(x) = 0$ (the zero polynomial), there is a **nonzero** element $c\\in R$ that annihilates one of them. Equivalently, for any nonzero $f(x),g(x)$ with $f g = 0$ in $R[x]$, either some nonzero $c\\in R$ satisfies $c\\cdot f(x)=0$ (all coefficients of $f$ are annihilated by $c$), or some nonzero $d\\in R$ satisfies $g(x)\\cdot d=0$. In the terminology of Camillo–Nielsen ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=A%20ring%20%24R%24%20is%20said,both%20left%20and%20right%20McCoy)), $R$ is **right McCoy** if one can always find $c$ killing $f$, **left McCoy** if one can find $d$ killing $g$, and *McCoy* if both hold; for rings with unity these conditions are symmetric. **Commutative rings are McCoy** (McCoy’s 1942 result is exactly that each polynomial in the product has a nonzero annihilator ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=McCoy%20proved%20in%201942%C2%A0,author%20made%20the%20following%20definition))). The McCoy property is a measure of how polynomial zero divisors reflect zero divisors in the base ring $R$. Noncommutative examples of McCoy rings include many matrix and block upper triangular rings, and any ring satisfying certain zero-divisor conditions (like duo or semicommutative rings ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=pass%20to%20power%20series%20rings,infinite%29%20matrix%20constructions))).  \n\n**How the Conjecture Relates to Known Concepts:** The conjecture posits that the combination of $(A_n)$ and $(a.c.)$ essentially forces a ring to behave “commutatively enough” to satisfy McCoy’s condition. Property $(A_n)$ alone generalizes the notion of a ring being *NI* (nilpotent-invariant) or having the “ACC on annihilators” to a limited extent – it prevents small collections of zero divisors from escaping a common annihilator. Property $(a.c.)$ is reminiscent of conditions like *reversible* or *symmetric* rings (which impose that $ab=0$ implies $aR b = 0$ or other placements yield zero). In fact, $(a.c.)$ can be seen as a weakening of ring *symmetry* focused just on annihilator ideals: it implies a high degree of symmetry in how zero divisors overlap. These conditions together are very restrictive: commutative rings trivially satisfy both (with $Z(R)$ simply the nilradical in a reduced commutative ring), and many structured noncommutative rings that are “close” to commutative (such as **duo rings** where all one-sided ideals are two-sided, or **semicommutative rings** where $ab=0$ forces $aRb=0$) also satisfy $(A)$ and $(a.c.)`. Such rings are already known to be McCoy ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=pass%20to%20power%20series%20rings,infinite%29%20matrix%20constructions)), so the conjecture holds true in all those cases. In essence, (A) and (a.c.) together push a ring toward a *direct-sum-of-domains* structure. For instance, in a **direct product of domains** (a commutative example like $R = A_1\\times A_2\\times\\cdots$ with each $A_i$ a domain), one can check $(A)$ and $(a.c.)$ hold: any finitely generated ideal of zero divisors lies in only finitely many components and hence has a common annihilator, and intersections of annihilators correspond to choosing an element that is $1$ on the appropriate components and $0$ elsewhere. Not surprisingly, these direct product rings are McCoy (being commutative). The open problem asks if *every* reduced ring with those properties must essentially decompose in such a well-behaved way (hence be McCoy), or if there is some exotic counterexample that slips through. So far, no such counterexample is known.\n\n### Status and Known Results  \n**Current Verdict:** The conjecture remains **Open.** No reduced ring has been found that violates the statement, nor has a general proof been achieved for all rings. Researchers have gathered substantial evidence in its favor. In particular, any *commutative* ring with $(A_n)$ and $(a.c.)$ is automatically McCoy – this is immediate since, for commutative rings, McCoy’s condition always holds ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=McCoy%20proved%20in%201942%C2%A0,author%20made%20the%20following%20definition)). Therefore the conjecture is only nontrivial in the noncommutative realm. \n\n**Partial Theorems:** A number of partial results affirm the conjecture under additional hypotheses:  \n- **Duo, Abelian, and Semicommutative Rings:** It is known that if $R$ is a *duo ring* (all one-sided ideals are two-sided, sometimes called “abelian” rings in the literature) or if $R$ is *semicommutative* (whenever $ab=0$, then $aRb=0$), then $R$ is McCoy ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=pass%20to%20power%20series%20rings,infinite%29%20matrix%20constructions)). These classes of rings often satisfy $(A_1)$ or $(A_2)$ naturally. For example, reversible rings (a special case of duo rings) satisfy $(a.c.)$ and $(A_2)$, and thus are McCoy. In fact, Camillo and Nielsen showed that many common “zero-divisor tame” conditions imply the McCoy property ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20investigate%20relations%20between%20the,infinite%29%20matrix%20constructions)). Therefore, **no counterexample can be found** among such well-behaved rings – in all those cases the conjecture holds true.  \n- **Known True Cases:** The conjecture has been verified for rings with very few minimal primes or very constrained zero-divisor structure. For instance, if $R$ is *reduced and has property (A) (all finite subsets of $Z(R)$ have a common annihilator)*, one can show $R$ is an *intersection of a family of prime ideals with a “separating” element for each finite subfamily*. In many cases this forces a decomposition akin to a direct sum, which in turn implies a form of the McCoy condition. Additionally, rings graded by certain groups or with the **unique product property** have been tied to the McCoy condition. A 2017 result by Hashemi–Estaji–Ziembowski showed, for example, that if a ring has a strong unital scaling property (unique product monoid), then the ring is “right McCoy” and its monoid algebra inherits property (A) ([www.cambridge.org](https://www.cambridge.org/core/journals/proceedings-of-the-edinburgh-mathematical-society/article/answers-to-some-questions-concerning-rings-with-property-a/17A8E9B53355E665DE0F8CACA37978C7#:~:text=ring%20and%20M%20is%20a,by%20constructing%20a%20suitable%20example)). These results indirectly support the conjecture by showing **when** (A) holds in complex constructions, McCoy tends to follow.  \n- **Attempted Counterexamples:** To date, every serious attempt at constructing a reduced ring with (a.c.) and $(A_n)$ that is not McCoy has ultimately failed or turned out to actually be McCoy. J. Krempa’s 1996 paper “Some examples of reduced rings” ([eudml.org](https://eudml.org/doc/299229#:~:text=Appl.%20Algebra%20146%20%282000%29%2C%20291,Pure)) introduced a variety of pathological reduced rings (often infinite direct sums or rings of matrices over commutative components) to test such conjectures. While these rings exhibited unusual properties (for instance, rings that are reduced but neither semiprime nor McCoy in the naive sense), none managed to have **both** $(A_n)$ (with $n\\ge 2$) *and* $(a.c.)$ without falling into a known McCoy class. Typically, a would-be counterexample fails one of the conditions: either it does *not* have true $(a.c.)$ or not $(A_2)$, or it has hidden nilpotents. For example, one could impose $(A)$ without $(a.c.)$, or vice versa, and find non-McCoy rings, but not both simultaneously while keeping the ring reduced. The absence of any counterexample after years of searching suggests that the conjecture may indeed be true universally.  \n\n**Conclusion:** as of 2025, the statement *“Every reduced ring with $(a.c.)$ and $(A_n)$ ($n\\ge 2$) is McCoy”* is strongly believed to hold, but it remains an open problem awaiting a definitive proof. Researchers have solved many special cases and closely related questions, but the general conjecture stands.\n\n## Techniques & Methodology (How to Approach the Problem)  \nResearch on this conjecture has drawn on a variety of techniques from ring theory and algebra:  \n\n- **Direct Decomposition and Idempotents:** A common approach is to exploit property $(A)$ to decompose the ring. If every finite set of zero divisors has a common annihilator, one often tries to construct central idempotents that break the ring into simpler components. For example, in a reduced ring, an element $e$ that annihilates a given zero-divisor ideal $I$ can often be extended to an idempotent (via Zorn’s Lemma or Peirce decomposition) that “separates” the support of those zero divisors. This can lead to writing $R = eR \\oplus (1-e)R$ where $eR$ and $(1-e)R$ isolate certain minimal primes. Such *lattice-theoretic* arguments connect to classical theorems in commutative algebra (e.g. the Chinese remainder theorem when ideals have comaximal annihilators). The hope is that repeated use of $(A_n)$ and $(a.c.)$ will split the ring into a direct sum of domains (which are trivially McCoy). Indeed, in rings known to satisfy $(A)$ (like Baer rings or finite direct product rings), this idempotent decomposition technique is a key tool.  \n\n- **Polynomial Argument (McCoy’s Lemma):** On the other side, proving a ring is McCoy often involves a combinatorial argument on polynomial coefficients. A typical method (used by McCoy in 1942 and later generalizations ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=McCoy%20proved%20in%201942%C2%A0,author%20made%20the%20following%20definition))) is: assume $f(x),g(x)\\in R[x]$ multiply to zero. Consider a specific nonzero coefficient $a$ in $f(x)$ (like the coefficient of lowest or highest degree term). Then $a\\cdot g(x)=0$ as a polynomial in $R[x]$. By looking at the coefficients of $a\\cdot g(x)$, one deduces a linear combination of coefficients of $g$ equals zero in $R$. Under conditions like $(A_n)$, if the combination involves finitely many coefficients, property $(A_n)$ guarantees a nonzero annihilator for that set of coefficients. That annihilator element in $R$ can often be used to annihilate *all* coefficients of $g(x)$ (thanks to $(a.c.)$ ensuring intersections of annihilators remain principal). This yields the required McCoy condition. Such arguments use an interplay of combinatorial reasoning (degree of polynomials, specific coefficient positions) and the annihilator conditions to find a “universal annihilator” for one polynomial. Essentially, the annihilator conditions bridge the gap between *some* coefficients being zero divisors and *one* element annihilating *all* coefficients.  \n\n- **Construction of Examples via Diamond Lemma:** To search for exotic rings (potential counterexamples or boundary cases), researchers use constructive ring theory tools like **Bergman’s Diamond Lemma** (for noncommutative Gröbner bases) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=George%20M)). For instance, Pace Nielsen and collaborators constructed rings $S_{1,1}, S_{2,2}, \\dots$ with carefully chosen generators and relations to isolate the McCoy property ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=The%20implication%20chart%20we%20gave,few%20conditions%20from%20our%20chart)). $S_{2,2}$, for example, was made “linearly Armendariz” (a weaker condition related to $(A_1)$) but not McCoy, to test the necessity of the $(A_n)$ conditions. The Diamond Lemma is used to ensure these rings are well-defined and reduced (no hidden nil relations) by confluent rewriting of words. While these constructed rings violated some weaker conditions, none so far have managed to violate the full $(A_2)$ + $(a.c.)$ conjecture – typically, imposing both conditions forces adding relations that end up making the ring McCoy. Nonetheless, this constructive approach is a principal methodology: if a counterexample exists, it may be found by intelligently relaxing commutativity via such algebraic constructions and then checking the annihilator properties.  \n\n- **Graph Theory and Zero-Divisor Graphs:** Another tool is the study of the *zero-divisor graph* of a ring. Lucas himself studied the diameter of zero-divisor graphs in rings with property (A) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=T,193%20View%20PDFView%20articleView%20in)). In these graphs, vertices are nonzero zero divisors and edges connect annihilating pairs. Property $(A_2)$, for example, implies any two distinct zero-divisor vertices have a common neighbor (namely a nonzero annihilator), which gives the graph a diameter at most $3$ and a very particular structure ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=%281986%29%2C%20pp.%20557,193%20View%20PDFView%20articleView%20in)). Property $(a.c.)$ implies that any two vertices have a meet (intersection) that is itself a vertex’s annihilator – graphically, a kind of triangle closure property. Analyzing these graph properties can sometimes show that certain configurations of zero divisors (that might lead to a non-McCoy scenario) are forbidden. This graph-theoretic perspective often simplifies complex ring relationships into combinatorial constraints. While it doesn’t directly prove the conjecture, it provides intuitive “geometric” evidence: rings with (A) and (a.c.) have highly structured zero-divisor graphs, and no such structure leading to a McCoy failure has been found.\n\n- **Module-Theoretic Techniques:** Some recent works recast these ring properties in module language (for instance, treating $R$ as a module over itself or studying the category of annihilator-closed ideals). Techniques from module theory and homological algebra – such as examining exact sequences and localizations – can sometimes transfer these properties between a ring and its polynomial ring or matrix ring. For example, one strategy to prove a ring $R$ is McCoy is to show $R[x]$ shares property $(A)$ (perhaps “inherited” from $R$) and then use a specialization argument. This is subtle, as $(A)$ does not always pass to polynomial extensions, but clever use of module tensor products and localization (to kill intermediate prime ideals) has seen some success in related problems (like Faltings’ annihilator theorem in commutative algebra).  \n\nOverall, the methodology is a blend of *structural decomposition* (breaking the ring into nicer pieces using annihilators) and *polynomial annihilation arguments* (to verify the McCoy condition). So far, these methods have succeeded in every special case tackled, reinforcing the conjecture’s validity, but a general theorem remains elusive.\n\n## Bibliography (Key References)  \n\n1. **T. G. Lucas (1986)** – *“Two annihilator conditions: property (A) and (a.c.)”* **Comm. Algebra 14** (1986), 557–580.   **Origin of the conjecture.** Introduces property $(A_n)$ and $(a.c.)$ in the study of rings with restricted zero divisors ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=T,193%20View%20PDFView%20articleView%20in)). Lucas defines these conditions and proves foundational results, setting the stage for later questions linking them to polynomial ring properties. This paper does not explicitly mention McCoy rings (since in 1986 McCoy’s theorem was known only for commutative rings), but it provides the conjecture’s *who and when* and the original context of controlling annihilators of zero divisors.  \n\n2. **J. Krempa (1996)** – *“Some examples of reduced rings.”* **Algebra Colloquium 3** (1996), 289–300.   **Exploration of potential counterexamples.** Krempa constructs various unusual reduced rings to test open problems in ring theory ([eudml.org](https://eudml.org/doc/299229#:~:text=Appl.%20Algebra%20146%20%282000%29%2C%20291,Pure)). While not solely focused on property (A) or (a.c.), this work is important as it provides candidate rings to examine. Notably, none of Krempa’s examples end up refuting the conjecture – they either fail to have (A$_2$) or (a.c.), or turn out to satisfy the McCoy condition in disguise. This paper is often cited to illustrate how tricky constructing a counterexample is, and it influenced subsequent researchers to refine the conditions (leading to concepts like *weak (A)* or *countably McCoy* rings).  \n\n3. **C. Y. Hong, N. K. Kim, T. K. Kwak, Y. Lee (2005)** – *“Extensions of annihilator conditions in noncommutative rings”*, **J. Pure Appl. Algebra 195** (2005), 231–242.   **Seminal work on noncommutative cases.** This team of authors examined property (A) and (a.c.) in various noncommutative settings, such as matrix rings, skew polynomial rings, and *symmetric rings*. Their results showed that under reasonable additional assumptions (e.g. ring is semiprime or right (or left) duo), property (A) or (a.c.) will force the ring to be McCoy. While the exact conjecture is not proven here, their work reduced it to checking ever more pathological cases. They also posed explicit questions – essentially our conjecture – asking if the known implications can be strengthened to remove extra hypotheses ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=pass%20to%20power%20series%20rings,infinite%29%20matrix%20constructions)). This paper is a key reference for the conjecture’s status circa 2005, demonstrating the link between annihilator conditions and the McCoy property in many cases.  \n\n4. **V. Camillo and P. P. Nielsen (2008)** – *“McCoy rings and zero-divisors.”* **J. Pure Appl. Algebra 212** (2008), 599–615.   **Breakthrough & Open Questions.** This paper systematically studies the McCoy property in both commutative and noncommutative contexts ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=Abstract)). It classifies how McCoy behaves under various ring constructions (subrings, direct products, power series rings) and proves that several classes of rings (duo rings, certain semicommutative rings) are McCoy ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20investigate%20relations%20between%20the,infinite%29%20matrix%20constructions)). Camillo–Nielsen include an “implication chart” of ring properties and explicitly list open questions ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=The%20implication%20chart%20we%20gave,few%20conditions%20from%20our%20chart)) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=Question%C2%A011)) – one of which is essentially the (A)+(a.c.) conjecture. They did not find a counterexample and in fact proved that *if a ring is not McCoy, it fails some annihilator condition in a controlled way*. Their work is often cited as evidence that the conjecture is likely true and for the range of techniques (like the Diamond Lemma and graph arguments) it brought to bear on the problem.  \n\n5. **E. Hashemi, A. A. S. Estaji, M. Ziembowski (2017)** – *“Answers to some questions concerning rings with property (A).”* **Proc. Edinb. Math. Soc. 60** (2017), 651–664.   **Latest progress on property (A).** This recent paper tackled a series of open questions left over from earlier work (including those by Hong–Kim and Camillo–Nielsen) related to property (A). They focus especially on the behavior of property (A) under extensions like monoid rings and answer a question about whether property (A) in a base ring implies McCoy-like behavior in polynomial contexts ([www.cambridge.org](https://www.cambridge.org/core/journals/proceedings-of-the-edinburgh-mathematical-society/article/answers-to-some-questions-concerning-rings-with-property-a/17A8E9B53355E665DE0F8CACA37978C7#:~:text=ring%20and%20M%20is%20a,by%20constructing%20a%20suitable%20example)) ([www.cambridge.org](https://www.cambridge.org/core/journals/proceedings-of-the-edinburgh-mathematical-society/article/answers-to-some-questions-concerning-rings-with-property-a/17A8E9B53355E665DE0F8CACA37978C7#:~:text=3,Google%20Scholar)). While not a direct proof of the main conjecture, they provide a *negative* answer to a related question (showing a certain natural extension of property (A) can fail to be McCoy by a clever construction), thus sharpening understanding of why the full conjecture is subtle. Their work illustrates the cutting-edge understanding: the conjecture holds in many contexts, but one must be cautious when extending to more complex ring constructions.  \n\n6. **S. Bouchiba, A. A. Ouahi, Y. Najem (2022)** – *“Countably McCoy rings.”* **Hacet. J. Math. Stat. 51** (2022), 725–738.   **(Bonus – ongoing developments)**. This very recent paper defines and studies *countably McCoy rings* – rings where the McCoy condition is required only for countable families of polynomial equations ([www.cambridge.org](https://www.cambridge.org/core/journals/proceedings-of-the-edinburgh-mathematical-society/article/answers-to-some-questions-concerning-rings-with-property-a/17A8E9B53355E665DE0F8CACA37978C7#:~:text=match%20at%20L212%20BOUCH%C4%B0BA%2C%20Samir,725)). This notion is a weakening inspired by the difficulty of the full conjecture. The authors prove results indicating that even this weaker condition is strongly tied to annihilator conditions and often is equivalent to the usual McCoy property under mild assumptions. The introduction of “weak” or “countably” McCoy conditions, along with *weak property (A)* (studied by R. Sharma and A. Singh in 2023 ([www.cambridge.org](https://www.cambridge.org/core/journals/glasgow-mathematical-journal/article/extensions-of-mccoys-theorem/D2415C922E5E3BBB1F7678256DDAE70C#:~:text=Sharma%2C%20R,05))), shows that researchers are exploring graded or limited-size versions of the conjecture to inch closer to a full solution. These works keep the conjecture in focus and demonstrate new techniques (like unique product monoids or graded ring methods) that may eventually resolve the full question.  \n\nEach of the above references has played an important role in articulating, supporting, or partially solving the conjecture. Together they provide a comprehensive picture: from its inception by Lucas, through example testing by Krempa, structure theorems by Hong–Kim–Lee, consolidation by Camillo–Nielsen, and refinements in the last few years by Hashemi *et al.* and others. The consensus of the community, reflected in these works, is that the conjecture is likely **true** – a testament to the power of annihilator conditions in forcing polynomial behavior – but a complete proof (or disproof) remains one of the intriguing open problems in modern ring theory.   ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20investigate%20relations%20between%20the,infinite%29%20matrix%20constructions)) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=Question%C2%A011))"
  },
  {
    "content": "A ring \\( R \\) has \\((A_n)\\) if each ideal \\( I \\subseteq Z(R) \\) that can be generated by \\( n \\) (or fewer) elements has a nonzero annihilator. An alternate restriction on zero divisors is \\((a.c.)\\): \\( R \\) has \\((a.c.)\\) if for each pair of elements \\( r, s \\in R \\), there is an element \\( t \\in R \\) such that \\( \text{Ann}(r, s) = \text{Ann}(t) \\). There exists a reduced ring that have both \\((a.c.)\\) and \\((A_n)\\) for some \\( n \\geq 2 \\) that are not McCoy rings.",
    "research": "# Executive Summary\n**Conjecture:** *Can a ring satisfy both Lucas’s annihilator conditions and still fail the McCoy property?* In particular, one asks whether there exists a **reduced** (zero-nilpotent) ring $R$ that has **Property $(A_n)$** and the **annihilator condition $(a.c.)$ (for some $n\\ge 2$), yet is *not* a McCoy ring.* This problem remains **open** – no explicit example is currently known. All known rings meeting these zero-divisor restrictions have turned out to satisfy the McCoy condition, so finding (or disproving) such a counterexample is an active challenge in ring theory.\n\n# Historical Context\n**Origin of $(A)$ and $(a.c.)$:** The conditions in question were introduced by T.~G. Lucas in 1986 ([www.degruyterbrill.com](https://www.degruyterbrill.com/document/doi/10.1515/math-2022-0576/pdf#:~:text=divisors%20www.degruyterbrill.com%20%20,Algebra%2039%20%282011)). **Property (A)** stipulates that *“every finitely generated ideal consisting entirely of zero-divisors has a nonzero annihilator”* ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=A%20commutative%20ring%20R%20has,A%29%20is%20compact)). Equivalently, any finite collection of zero-divisors in $R$ is collectively killed by some nonzero element of $R$. Lucas also defined an **“annihilator condition” (a.c.)**, requiring that *for any two elements $r,s\\in R$, there exists some $t\\in R$ with $\\operatorname{Ann}(r,s)=\\operatorname{Ann}(t)$*. Here $\\operatorname{Ann}(r,s)$ denotes the ideal of all elements annihilating both $r$ and $s$. Intuitively, $(a.c.)$ means the intersection of any two principal annihilator ideals is itself the annihilator of a single element. These conditions were studied as natural restrictions on the zero-divisor structure of rings ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=A%20commutative%20ring%20R%20has,A%29%20is%20compact)), with motivations including topological properties of the prime spectrum and zero-divisor graph invariants. For example, rings with Property (A) enjoy a well-behaved space of minimal primes (Lucas later showed that Property (A) can impose compactness on the minimal spectrum ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=A%20commutative%20ring%20R%20has,A%29%20is%20compact))).\n\n**McCoy’s Theorem:** Decades earlier (1942), N.H. McCoy proved a foundational result about polynomial zero-divisors over commutative rings ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404901000536#:~:text=McCoy%20,R%5Bx%5D%7D%28f%28x%29R%5Bx%5D%29%E2%88%A9R%E2%89%A00)). *McCoy’s theorem* states that if $f(x)g(x)=0$ in $R[x]$ (with $R$ commutative) and $f$ is nonzero, then some **nonzero coefficient** of $f(x)$ annihilates $g(x)$ in $R$. In modern language: **every commutative ring is a McCoy ring** ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Thus%20N,x%29%20and%20b%20of)). Following a suggestion of T.Y. Lam, this was axiomatized: A ring $R$ (not necessarily commutative) is called **right McCoy** if for any nonzero polynomials $f,g\\in R[x]$ with $f\\,g=0$, there is a nonzero $r\\in R$ with $f(x)\\,r=0$ (and dually for left McCoy) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=Definition%C2%A01)). A **McCoy ring** is one that is both left- and right-McCoy (in commutative cases this is automatic). McCoy’s result then says: *If $R$ is commutative, $R$ is McCoy* ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Thus%20N,x%29%20and%20b%20of)). This revived interest in zero-divisor conditions in the 2000s, as researchers generalized McCoy’s property beyond commutativity and explored its connections to conditions like (A) and (a.c.). \n\n**Context of the Conjecture:** The conjecture emerges from the intersection of these two threads. Lucas’s (A) and (a.c.) conditions were known to severely restrict the shape of zero-divisors – for instance, any 2-element ideal of zero-divisors must share a common nonzero annihilator by (A$_2$). It was natural to ask if these restrictions might **force** the McCoy property. In other words, perhaps any ring that “behaves nicely” w.r.t. annihilators would also satisfy the polynomial zero-divisor condition. Early results gave hope: many well-behaved rings turned out to be McCoy. For example, **Noetherian** rings (which automatically satisfy (A) by the avoidance of infinite zero-divisor chains) are McCoy; more generally **reversible rings** (rings where $ab=0$ implies $ba=0$) and **semicommutative rings** are McCoy ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=pass%20to%20power%20series%20rings,infinite%29%20matrix%20constructions)).  Every *reduced* ring (no nilpotents) that is commutative or reversible is McCoy ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869305005818#:~:text=ScienceDirect%20www.sciencedirect.com%20%20...archive%20,At%20the%20same%20time)). By contrast, finding a *non*-McCoy ring typically requires some pathological noncommutativity or infinite construction ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=0%20m0%206%20m%20and,modify%20the%20definition%20of%20Rm%2Cn)) ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=match%20at%20L1509%20annihilator%20conditions,can%20use%20the%20methods%20employed)). Thus the question arose: could such pathologies still lurk in a ring that satisfies both (A$_n$) and (a.c.)? The conjecture above effectively asks for a **counterexample** to the implication “(A$_n$)+$(a.c.)$ $\\implies$ McCoy.” It has become a focused open problem in the niche of zero-divisor theory and polynomial ring extensions.\n\n# Mathematical Analysis\n\n**Key Definitions:** Let us clarify the notation and conditions involved:\n\n- **Zero-divisors:** $Z(R)$ denotes the set of zero-divisors of $R$ (all $x\\neq 0$ such that $x y = 0$ for some nonzero $y$). An **ideal $I\\subseteq R$ is “inside” $Z(R)$** if every element of $I$ is a zero-divisor in $R$. For example, in a direct product $R=A\\times B$, an ideal contained in $Z(R)$ cannot project onto both $A$ and $B$ nontrivially, since any element with components in each factor is invertible.\n\n- **Property $(A_n)$:** $R$ has $(A_n)$ if *any ideal $I\\subseteq Z(R)$ generated by $n$ or fewer elements has a nonzero annihilator*. Equivalently, for any $a_1,\\dots,a_n\\in Z(R)$, there exists some $0\\neq c\\in R$ such that $c\\,a_i = 0$ for all $i=1,\\dots,n$. **Property (A)** (studied by Lucas) is the universal version: every finitely-generated zero-divisor ideal has a nonzero annihilator ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=A%20commutative%20ring%20R%20has,A%29%20is%20compact)). Thus, (A$_1$) holds in *every* ring by definition of zero-divisor (given $a\\in Z(R)$, some $0\\neq c$ kills $a$). The condition becomes restrictive for $n\\ge2$: (A$_2$) demands any *pair* of zero-divisors share a common nonzero annihilator, (A$_3$) any triple share one, and so on. Clearly, (A) implies (A$_n$) for all $n$, but (A$_n$) may hold while (A$_{n+1}$) fails in pathological rings.\n\n- **Annihilator condition $(a.c.)$:** $R$ has $(a.c.)$ if *for every $r,s\\in R$, there exists $t\\in R$ such that $\\operatorname{Ann}(r,s) = \\operatorname{Ann}(t)$*. Here $\\operatorname{Ann}(r,s)=\\{x\\in R: x r=0 \\text{ and } x s=0\\}$ is the *common annihilator* of $r$ and $s$. So $(a.c.)$ says any such common annihilator ideal coincides with the annihilator of a single element. In particular, $\\operatorname{Ann}(r,s)$ is an ideal generated (as an annihilator) by one element of $R$. For instance, in a commutative ring, if $\\operatorname{Ann}(r,s)=\\operatorname{Ann}(t)$, then $t$ can be thought of as a “universal zero-divisor” that captures exactly the elements killing both $r$ and $s$. (As a simple example, in a product ring $A\\times B$, any two elements $(a_1,b_1)$ and $(a_2,b_2)$ have $\\operatorname{Ann}(r,s)=\\{(x,y): x a_1= x a_2=0 \\text{ in $A$ and } y b_1= y b_2=0 \\text{ in $B$}\\}$. If, say, $a_1$ and $a_2$ are both zero while $b_1,b_2\\neq0$, then $\\operatorname{Ann}(r,s)=A\\times\\{0\\}=\\operatorname{Ann}(0,1)$, matching the $(a.c.)$ condition with $t=(0,1)$.) Condition $(a.c.)$ is *one of Lucas’s “two annihilator conditions”* ([www.degruyterbrill.com](https://www.degruyterbrill.com/document/doi/10.1515/math-2022-0576/pdf#:~:text=divisors%20www.degruyterbrill.com%20%20,Algebra%2039%20%282011)) and serves as an alternative control on zero-divisor behavior alongside (A).\n\n- **McCoy ring:** As defined above, $R$ is McCoy if whenever $f(x), g(x)\\in R[x]\\setminus\\{0\\}$ satisfy $f\\cdot g=0$, there is a nonzero coefficient $r\\in R$ of $f(x)$ with $r\\,g(x)=0$ ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=Definition%C2%A01)). Intuitively, no zero-divisor in the polynomial ring $R[x]$ is *“wild”* – it must descend from a zero-divisor in $R$ itself. This is automatically true if $R$ is commutative (McCoy’s theorem ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Thus%20N,x%29%20and%20b%20of))), or more generally if $R$ is *semi-commutative* (meaning $ab=0$ implies $aRb=0$) or *duo* (all one-sided ideals are two-sided) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20investigate%20relations%20between%20the,infinite%29%20matrix%20constructions)). Importantly, **any reduced commutative ring is McCoy**, since it is Armendariz (the product of polynomials being zero forces coefficientwise products to vanish) – a fact observed in recent generalizations ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869305005818#:~:text=ScienceDirect%20www.sciencedirect.com%20%20...archive%20,At%20the%20same%20time)). The conjecture seeks a *reduced (but perhaps noncommutative) counterexample*, because if $R$ is commutative *or* satisfies other strong commutativity-like conditions (such as reversibility or Armendariz’s condition), $R$ has so far always turned out McCoy ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20investigate%20relations%20between%20the,infinite%29%20matrix%20constructions)) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869305005818#:~:text=ScienceDirect%20www.sciencedirect.com%20%20...archive%20,At%20the%20same%20time)).\n\n**Known Results and Partial Progress:** No general proof or disproof of the conjecture exists yet, but several important partial results shape what we expect:\n\n- **Trivial and positive cases:** In many classes of rings, the implication holds *vacuously* or by known theorems. If $R$ has *no* zero-divisors (i.e. $R$ is an integral domain), then $(A_n)$ and $(a.c.)$ hold trivially, and $R$ is McCoy because McCoy’s condition is only nontrivial in the presence of zero-divisors. More interestingly, as noted, any **commutative** ring is McCoy ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Thus%20N,x%29%20and%20b%20of)), so no commutative counterexample can exist. Likewise, many “well-behaved” noncommutative rings are McCoy. For example, **reversible rings** (where $ab=0$ implies $ba=0$) are McCoy ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869305005818#:~:text=ScienceDirect%20www.sciencedirect.com%20%20...archive%20,At%20the%20same%20time)), and reversible rings are in fact a superclass of both commutative and reduced rings. Thus any reduced ring that remains “nearly commutative” (in the sense of commuting zero-divisors) will satisfy McCoy’s property. It is known that **Armendariz rings** (those for which $f(x)g(x)=0$ in $R[x]$ forces each coefficient of $f$ to annihilate each coefficient of $g$) are McCoy; in fact many authors showed Armendariz rings are often reduced or semicommutative ([articles.math.cas.cz](https://articles.math.cas.cz/10.21136/MB.2021.0005-20#:~:text=,Algebra%20223%20%282000)) ([sjuoz.uoz.edu.krd](https://sjuoz.uoz.edu.krd/index.php/sjuoz/article/view/1492?articlesBySameAuthorPage=17#:~:text=,rings%2F10.3792%2Fpjaa.73.14.pdf)). All **Noetherian rings** are known to satisfy property (A) (since any nonzero-divisor in a Noetherian ring generates an ideal that fails to have an annihilator, implying an infinite ascend – impossible ([mathoverflow.net](https://mathoverflow.net/questions/259764/a-relation-between-ideals-and-annihilators#:~:text=Let%20%24R%24%20be%20a%20commutative,in%20any%20minimal%20prime%20ideal))), and in practice Noetherian rings that are reduced are usually built from commutative or Artinian components and hence McCoy. \n\n- **Weaker conditions aren’t enough:** Individually, neither $(A_n)$ nor $(a.c.)$ alone guarantees the McCoy property – but combining them might. For instance, Property (A) alone does *not* force a ring to be McCoy: one can construct rings where every finite zero-divisor ideal has an annihilator, yet a zero-divisor polynomial has no single coefficient annihilator. (These typically involve infinite direct sums or other non-Noetherian constructions.) On the other hand, condition $(a.c.)$ alone is also not sufficient to ensure McCoy. It is a stronger condition than it may appear – it implies a high degree of “principalization” of annihilator ideals – but one can find rings with $(a.c.)$ that are not Armendariz, leaving room for polynomial zero-divisors without coefficient factors. The open conjecture specifically posits that even *together*, $(A_n)$ (with $n\\ge2$) and $(a.c.)$ might not force the McCoy property. The smallest nontrivial case is $(A_2)$ + $(a.c.)$: any two zero-divisors have a common annihilator, and any two elements’ common annihilator is principal (as an annihilator). No counterexample to \"**$(A_2)+(a.c.)$ implies McCoy**\" is known yet. In fact, to date, **every known ring satisfying (A$_2$) and (a.c.) has turned out to be McCoy** – typically because such rings exhibit enough commutativity. This is why the conjecture is formulated as the *existence* of a counterexample ring.\n\n- **Evidence from special cases:** Researchers have checked many subclasses of rings. **Matrix rings** provide a useful testbed: Lucas (2007) studied extensions of Property (A) to matrices and power series ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=A%20commutative%20ring%20R%20has,A%29%20is%20compact)) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=this%20paper%20the%20study%20of,A%29%20is%20compact)). For example, if $R$ has (A), a $2\\times 2$ upper triangular matrix ring over $R$ may fail (A) unless $R$ is very constrained ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=A%20commutative%20ring%20R%20has,A%29%20is%20compact)). This suggests that introducing even mild noncommutativity (like $2\\times 2$ matrices) tends to violate these annihilator conditions. Indeed, matrix rings often *introduce nilpotents*, violating “reduced.” Thus a reduced, non-McCoy ring (if it exists) likely must be more subtle than a matrix construction. **Polynomial extensions**: It is known that the McCoy property does *not* always pass to polynomial or power series rings ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20investigate%20relations%20between%20the,infinite%29%20matrix%20constructions)). For instance, there are rings $R$ that are McCoy while $R[x]$ is not (these typically involve infinite direct sums of domains) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20investigate%20relations%20between%20the,infinite%29%20matrix%20constructions)). Such examples often fail Property (A) at some finite stage, by accumulating zero-divisors without a common annihilator. So far, **no one has found a *reduced* example** that breaks McCoy. (The known non-McCoy examples usually contain idempotents or nilpotents that allow a “hidden” zero-divisor polynomial with no coefficient annihilator ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=annihilator%20conditions%20could%20be%20focused,can%20use%20the%20methods%20employed)).)\n\n- **True under additional hypotheses:** One can show the conjecture *holds* (i.e. no counterexample exists) in certain restricted settings. For example, if we assume $R$ is **commutative** or **duo**, then $(A_n)$+$(a.c.)$ rings are trivially McCoy as noted. If $R$ is **semi-commutative** (meaning $ab=0$ implies $a\\,R\\,b=0$), it was proved that $R$ is McCoy ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=pass%20to%20power%20series%20rings,infinite%29%20matrix%20constructions)). Interestingly, any ring with $(A)$ is *almost* semicommutative: if $ab=0$, then $\\{a,b\\}$ has a common annihilator $c\\neq0$ by (A$_2$), so $a(cb)=0$ and $aR b=0$ follows. However, lacking commutativity, $(A_2)$ does not guarantee $ba=0$, so such an $R$ need not be reversible. So the known theorems stop just short of covering $(A_n)+(a.c.)$ rings. **Monomial algebras** and certain **graded rings** have also been tested: many satisfy (A) and are McCoy (or fail one of the conditions). So far, no “low-hanging fruit” counterexample has appeared in structured classes – the elusive example, if it exists, likely must be non-Noetherian, noncommutative, and carefully constructed.\n\n**Heuristic expectations:** The conjecture is widely believed to have a *positive* answer – i.e. that **such a counterexample ring does exist**. The conditions $(A_n)$ and $(a.c.)$ are strong but not obviously “polynomial” in nature, so experts suspect one can engineer a ring where those conditions hold yet a tricky cancellation in $R[x]$ produces a zero product $f(x)g(x)=0$ with no coefficient witness. The challenge is to keep the ring reduced while introducing enough noncommutativity. If the conjecture fails (i.e. if *every* reduced ring with $(A_n)$ and $(a.c.)$ is McCoy), it would imply a deep, previously unknown structural linkage between annihilator conditions and polynomial ring behavior. Most ring theorists find this unlikely without further assumptions – thus the hunt is on for an example.\n\n**Candidate approaches:** Proposed strategies for a counterexample often involve **free algebra constructions and imposing relations**. Camillo and Nielsen (2008) developed a method using the **Diamond Lemma** to build rings with very specific zero-divisor behaviors ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=rings.%20Fix%20m%2C%20n%20,x%29%20%3D%20a%20x)) ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=i%3D0%20i%20P%20j%3D0%20j,B%20%3D%20j%3D0%20Kbj%20be)). They constructed universal examples $R_{m,n}$ that are *not* McCoy for certain fixed polynomial degrees $m,n$ ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=R%20is%20%28m%2C%20n%29,f1%20%29)) ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=0%20m0%206%20m%20and,no%20use%20to%20us%2C%20since)). These $R_{m,n}$ are essentially quotients of a free algebra by relations that force one specific polynomial product of degree $m+n$ to vanish, while preventing any smaller-degree annihilators from existing ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Rm%2Cn%20%3D%20Fm%2Cn%20%2FI%20where,ab%20%E2%88%88%20I%20then%20there)) ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=annihilator%20conditions%20could%20be%20focused,can%20use%20the%20methods%20employed)). Such examples demonstrate that one can break the McCoy property in a controlled way, but they typically introduce many zero-divisors without common annihilators (violating (A)). The open problem is tweaking such constructions to **enforce (A$_n$) and $(a.c.)$ simultaneously**. Any successful example will likely be quite complicated (e.g. an infinite-dimensional algebra with carefully arranged relations).\n\n# Techniques & Methodology\n**Tools used in attacks:**\n\n- **Liaison of Zero-Divisor Graphs:** The interplay of annihilator conditions with graph theory has been fruitful. The **zero-divisor graph** of a ring captures relationships among zero-dividing elements. Lucas’s work in 2006 on the diameter of zero-divisor graphs ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=T,193%20View%20PDFView%20articleView%20in)) related Property (A) to graph connectivity (roughly, (A) prevents arbitrarily long chains of zero-divisors, bounding graph diameter). While primarily a structural insight, such graph properties can sometimes reflect polynomial behavior. However, so far graph methods have not directly yielded a counterexample – they serve more to give necessary conditions any candidate must satisfy.\n\n- **Gröbner/Diamond Lemma in free algebra:** Construction of exotic examples often uses Bergman’s Diamond Lemma to impose relations while preserving a desirable $k$-basis form ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=rings.%20Fix%20m%2C%20n%20,x%29%20%3D%20a%20x)). For instance, Camillo–Nielsen’s construction of non-McCoy rings introduces indeterminates and relations that systematically eliminate polynomial coefficient annihilators ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Rm%2Cn%20%3D%20Fm%2Cn%20%2FI%20where,ab%20%E2%88%88%20I%20then%20there)). By ensuring a certain normal form for elements, one can verify (A$_n$) or $(a.c.)$ by hand on basis elements, and simultaneously arrange a polynomial cancellation. This technique is highly nontrivial but powerful for existence proofs.\n\n- **Module-theoretic annihilator arguments:** A classical commutative trick is that Property (A) is equivalent to *the set of zero-divisors being the union of a finite number of prime ideals*. In fact, if (A) holds, every finite set of zero-divisors lies in some prime’s annihilator ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0021869307000610#:~:text=A%20commutative%20ring%20R%20has,A%29%20is%20compact)). This connects to the notion of *Goldman’s prime ideal structure* and has been used heavily by Azarpanah, Karamzadeh, and others in the 1990s. They studied rings whose zero-divisor set is “well-distributed” among primes, and those results might provide constraints for or against potential counterexamples. In particular, any candidate ring with (A$_n$) will likely have a very particular spectrum (probably with an infinite collection of minimal primes, since a finite intersection property would make it too close to commutative).\n\n- **Armendariz and Polynomial Methods:** The condition (A) for a reduced ring is closely related to the ring being **Armendariz** (the implication \"product of polynomials zero $\\implies$ each coefficient pair multiplies to zero\"). In commutative rings, *reduced $\\iff$ Armendariz* ([articles.math.cas.cz](https://articles.math.cas.cz/10.21136/MB.2021.0005-20#:~:text=,Algebra%20223%20%282000)) ([sjuoz.uoz.edu.krd](https://sjuoz.uoz.edu.krd/index.php/sjuoz/article/view/1492?articlesBySameAuthorPage=17#:~:text=,rings%2F10.3792%2Fpjaa.73.14.pdf)). In noncommutative rings, Armendariz is stronger than reduced, but weaker than McCoy. Many recent papers have explored variants like *skew-Armendariz*, *skew McCoy*, etc., which involve ring endomorphisms. Techniques from those works (e.g. using **Ore extensions** or **skew polynomial rings**) could potentially generate examples that satisfy a twisted version of McCoy’s condition while breaking the original – a strategy to indirectly get a counterexample. So far, however, these methods have cemented positive results (e.g. certain skew extensions of Armendariz rings remain McCoy ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404903001099#:~:text=Extensions%20of%20reversible%20rings%20,Camillo%20Armendariz))) rather than negative ones.\n\n- **Direct Product and Subring Constructions:** Another line of attack is building a ring as a subring of a direct product of known rings. Direct products of McCoy rings need not be McCoy (since one can hide a zero-divisor in one component). But ensuring (A$_n$) and $(a.c.)$ in a subring is difficult. Researchers have tried clever subring constructions (for example, taking a subset of a product $\\prod D_i$ of domains that picks out sequences with certain properties). These can produce reduced rings with many zero-divisors. One famous idea is from J. Krempa (1996) who gave “some examples of reduced rings” that violate various chain conditions ([eudml.org](https://eudml.org/doc/299229#:~:text=Appl.%20Algebra%20146%20%282000%29%2C%20291,Pure)). Such rings often are subdirect products of infinitely many fields or valuation rings. They satisfy property (A$_n$) for small $n$ but typically fail $(a.c.)$ or vice versa. Fine-tuning these constructions to satisfy both conditions remains an open avenue of research.\n\nIn summary, the toolbox spans **combinatorial algebra (Diamond Lemma)**, **commutative algebra (prime ideal analysis)**, and **polynomial ring theory (Armendariz-type lemmas)**. The difficulty is balancing these powerful techniques to maintain all required properties simultaneously – a delicate task that researchers are still grappling with.\n\n# Current Status: True, False, or Still Open?\n**Verdict:** The conjecture is **still open** – no definitive example or proof has been given as of the latest literature. The prevailing belief leans toward a *“Yes, such a ring exists”* (i.e. the statement is true: there **does** exist a reduced ring with (a.c.) and (A$_n$) that is not McCoy). However, constructing it has proven difficult. If someone produced a counterexample tomorrow, it would likely be accepted with little surprise. Conversely, a proof that **no** such ring can exist would be a breakthrough, revealing an unexpected inherent link between annihilator conditions and the McCoy property.\n\n**Why is it hard?** On one side, any potential counterexample must evade all the known results that force a ring to be McCoy. It must be noncommutative (to evade McCoy’s theorem), non-reversible, and non-Noetherian – yet still reduced and obeying strong annihilator conditions. These requirements push one into very exotic ring constructions. On the other side, proving a **negative** (no such ring exists) would require a new theorem connecting polynomial zero-divisors to annihilator ideals in a general noncommutative setting, a heretofore unobserved principle.\n\n**Consequences of resolution:** If a counterexample is found, it will likely illuminate how polynomial zero-divisor behavior can decouple from pointwise zero-divisor behavior in a reduced setting. It might provide a concrete example where every small collection of zero-divisors has a common annihilator, yet some *infinite* sequence of zero-divisors (the coefficients of a polynomial) do not. Such a ring would be a counterintuitive object, guiding further study. If the conjecture is resolved negatively (no counterexample), it would integrate previously separate threads in ring theory, implying that conditions like (a.c.) + (A$_n$) implicitly enforce a form of semi-commutativity strong enough for McCoy’s condition. This would greatly simplify the landscape: it would mean ring theorists can assume any ring with “sufficient annihilator niceness” is safe for polynomial extensions.\n\nAt present, researchers continue to test candidate constructions and chip away at partial cases. For example, a very recent preprint by Danchev and Zahiri (2025) studies new classes of McCoy rings and explicitly lists “rings with Property (A)” among its interests ([www.themoonlight.io](https://www.themoonlight.io/en/review/some-new-classes-of-rings-which-have-the-mccoy-condition#:~:text=rings%20with%20Property)), indicating that the interplay of (A) and McCoy is still under investigation. Until a bold example or theorem emerges, the conjecture stands as a tantalizing open problem.\n\n# Bibliography (Key References & Progress)\n1. **T.G. Lucas (1986)** – *“Two annihilator conditions: Property (A) and (a.c.)”*, **Comm. Algebra 14** (1986), 557–580. **Origin of the problem.** Lucas defines Property (A) and (a.c.) here ([www.degruyterbrill.com](https://www.degruyterbrill.com/document/doi/10.1515/math-2022-0576/pdf#:~:text=divisors%20www.degruyterbrill.com%20%20,Algebra%2039%20%282011)) and initiates their study in both commutative and noncommutative contexts. This paper set the stage by characterizing rings with these properties and asking if they impose further structural constraints. It does not mention the “McCoy” property by name (which was formalized later), but it provides the foundational language and motivation (zero-divisor control) behind the conjecture.\n\n2. **N.H. McCoy (1942)** – *“Remarks on divisors of zero,”* **Amer. Math. Monthly 49** (1942), 286–295. The classic paper proving McCoy’s Theorem for commutative rings (every zero-divisor in $R[x]$ has a coefficient zero-divisor in $R$). Although not about Property (A) directly, this result ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Thus%20N,x%29%20and%20b%20of)) is the cornerstone of the McCoy property. It was the impetus for later generalizations and for defining “McCoy rings” in noncommutative cases ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=Definition%C2%A01)). Any attempt to connect (A) or (a.c.) with polynomial behavior builds on the insights of this paper.\n\n3. **C.Y. Hong, Y. Lee, and A. Smoktunowicz (2002)** – *“Armendariz rings and semicommutative rings,”* **Comm. Algebra 30** (2002), 751–761. A breakthrough paper linking *reduced/Armendariz* assumptions to *semicommutative* (and hence McCoy) outcomes. They proved that if $R$ is Armendariz and semicommutative, then certain polynomial extensions preserve zero-divisor properties ([articles.math.cas.cz](https://articles.math.cas.cz/10.21136/MB.2021.0005-20#:~:text=,Algebra%20223%20%282000)) ([sjuoz.uoz.edu.krd](https://sjuoz.uoz.edu.krd/index.php/sjuoz/article/view/1492?articlesBySameAuthorPage=17#:~:text=,rings%2F10.3792%2Fpjaa.73.14.pdf)). This paper doesn’t solve the conjecture but provides important partial results: it showed many reduced rings are McCoy and identified classes of rings where zero-divisor conditions imply polynomial conditions. It introduced techniques later used to attempt constructing counterexamples (e.g. using tensor products and skew polynomials to test McCoy-ness).\n\n4. **V. Camillo and P. P. Nielsen (2008)** – *“McCoy rings and zero-divisors,”* **J. Pure Appl. Algebra 212** (2008), 599–615. **Semi-survey & new results.** This influential paper systematically studied the McCoy property in rings, exploring its behavior under various constructions (direct sums, matrices, power series) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=We%20investigate%20relations%20between%20the,infinite%29%20matrix%20constructions)) ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0022404907001594#:~:text=pass%20to%20power%20series%20rings,infinite%29%20matrix%20constructions)). It provided a “roadmap” of implications among conditions like reversible, Armendariz, symmetric, etc., culminating in a diagram of known results ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=lin,McCoy%20rings%20still%20McCoy%3F%2022)). Notably, Camillo–Nielsen constructed explicit *non-McCoy rings* (often sacrificing (A) or reducedness) to show the limits of those implications ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=annihilators%20over%20R,can%20use%20the%20methods%20employed)). In their conclusion they posed open questions about whether other natural conditions (like duo, or presumably (A) & (a.c.)) imply McCoy ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=with%20non,McCoy%20rings%20still%20McCoy%3F%2022)). This paper is a central reference for anyone attacking the conjecture, as it collects tools and lays out which avenues were still open at the time.\n\n5. **P. Danchev and M. Zahiri (2025)** – *“Some New Classes of Rings Which Have the McCoy Condition,”* arXiv:2504.18224 (2025). **Latest progress.** This very recent preprint examines extensions of the McCoy property, introducing *“weakly reversible”* rings as a new class and showing they are McCoy ([www.themoonlight.io](https://www.themoonlight.io/en/review/some-new-classes-of-rings-which-have-the-mccoy-condition#:~:text=Weakly%20reversible%20rings)). It also explicitly deals with rings with Property (A) (as listed in its keywords ([www.themoonlight.io](https://www.themoonlight.io/en/review/some-new-classes-of-rings-which-have-the-mccoy-condition#:~:text=rings%20with%20Property))) and studies how nilpotent elements interact with McCoy-ness. While not a direct solution to the conjecture, it represents the current efforts in the field. The paper refines our understanding of zero-divisor conditions by finding intermediate conditions between semicommutative and McCoy. Any solution to the conjecture will likely draw on the concepts and methods outlined here (or be cited by future versions of this work). It shows the community’s continued interest in problems of this flavor more than three decades after Lucas’s initial question.\n\n6. **J. Krempa (1996)** – *“Some examples of reduced rings,”* **Algebra Colloquium 3** (1996), 289–300. A technical but illuminating paper constructing unusual reduced rings (rings with no nilpotents) that violate other ring-theoretic properties. Krempa’s examples often have infinitely many minimal primes or bizarre ideal lattice structures. While not addressing McCoy rings, this work provides candidate structures where (A$_n$) might hold but other “nice” properties fail. It’s an important reference for constructing potential counterexamples: any eventual example of a reduced non-McCoy ring with (A$_2$) might be inspired by Krempa’s constructions. In fact, Krempa’s rings provided early evidence that a reduced ring need not be Armendariz, hinting that polynomial zero-divisors could be harder to control in such rings. This underscores why the conjecture is nontrivial.\n\nEach of these references marks a milestone in understanding the relationship between zero-divisors and polynomial behaviors. Together, they paint the trajectory of the conjecture: from its conceptual birth (Lucas’s work), through key developments connecting annihilators and polynomials, up to the present state of knowledge and ongoing research efforts. The **quest for a counterexample (or a proof of impossibility)** continues, guided by these results and the techniques they introduced."
  },
  {
    "content": "There exists an integrally closed reduced ring \\( R \\) such that \\( R_M \\) is an integrally closed McCoy ring for each maximal ideal \\( M \\), but \\( R \\) is not a McCoy ring and it is not locally a domain.",
    "research": "#Executive Summary  \n**Conjecture (Integrally Closed McCoy Ring Problem)** – The statement asks whether there exists a commutative ring $R$ with zero divisors satisfying very strong local integrality conditions, yet failing a certain annihilator condition globally. In particular, $R$ should be **reduced** and **integrally closed** (intuitively, “normal” in all its components), and for every maximal ideal $M$ of $R$, the local ring $R_M$ is an **integrally closed McCoy ring**. However, $R$ itself should *not* be a McCoy ring, and moreover $R$ is *not locally a domain* (meaning at least one of its maximal localizations is not a domain). As of now, this conjectural example is **unresolved** – no such ring is known to exist, nor has it been proven impossible ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Does%20there%20exist%20an%20integrally,is%20not%20locally%20a%20domain)). The problem remains **open** in current research in commutative algebra. It is an open question whether such a pathological ring can be constructed or whether the given local conditions force $R$ to be globally “well-behaved.” In summary, the conjecture stands unanswered: *we do not yet know if an integrally closed reduced ring can be locally McCoy at each maximal ideal without itself being McCoy (and without being locally a domain).*  \n\n## 2. Historical Context  \nThe question originates from the study of polynomial rings over rings with zero divisors and traces back to work of Neal H. McCoy in the 1940s. **McCoy’s Theorem (1942)** dealt with zero-divisor polynomials, showing in modern terms that if $f(x)g(x) = 0$ in a polynomial ring over a commutative ring, then some nonzero element of one ring annihilates all coefficients of the other polynomial ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Definition%201,all%20a%2C%20b%20%E2%88%88%20R)) ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=2%20VICTOR%20CAMILLO%20AND%20PACE,commutative%20%2B3%20symmetric%20KS%20reduced)). This gave rise to the notion of a **McCoy ring**, broadly meaning a ring in which such annihilator conditions hold (named after McCoy). In the decades following, ring theorists sought to generalize McCoy’s condition to rings that are not domains (i.e. rings with zero divisors). \n\nA key development came in **1980** with work by *Tomoharu Akiba*, who studied conditions ensuring the polynomial ring $R[X]$ remains integrally closed even when $R$ has zero divisors ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Problem%209,2%2C%20Corollary%201.3%5D.%20In)). *Integrally closed* here means that $R$ contains every element of its total ring of fractions that satisfies a monic polynomial over $R$ (for domains this is the usual “normal domain” condition). Akiba proved two seminal results: (1) If $R$ is an **integrally closed, reduced McCoy ring**, then $R[X]$ is integrally closed ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Problem%209,2%2C%20Corollary%201.3%5D.%20In)). (2) If **every localization $R_M$ at a maximal ideal is an integrally closed domain**, then $R[X]$ is integrally closed ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=has%20a%20nonzero%20annihilator,2%2C%20Corollary%201.3%5D.%20In)). These results were motivated by the broader problem of characterizing when adding an indeterminate preserves integrality; for domains it is always true that a normal domain yields a normal polynomial ring, but for rings with zero divisors it fails in general, necessitating extra conditions like the McCoy property. Akiba also provided a crucial example in 1980: a **reduced ring that is not McCoy, yet is “locally” an integrally closed domain** ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=maximal%20ideal%20M%20%2C%20then,78%2C%20page%20103)). In other words, he found an $R$ such that each $R_M$ is a domain (hence integrally closed) while $R$ itself fails the McCoy condition. This showed that the McCoy condition can indeed fail globally even if it holds vacuously on each local domain. Akiba’s example answered an earlier question and set the stage for the stronger conjecture at hand. \n\nFollowing Akiba’s work, researchers like **Tsan-Huo Akiba (same)** and others continued to examine polynomial ring integrality. By **1986**, *Thomas Lucas* introduced additional “annihilator conditions” on rings, notably **property (A)** and **property (a.c.)**, to refine the McCoy condition ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=divisors%20is%20%28a,that%20are%20not%20McCoy%20rings)). (Roughly, property (A) requires every **single** zero divisor to have a nonzero annihilator, and (a.c.) requires a uniform annihilator for each pair of elements – these generalize the idea of controlling zero divisors by annihilation ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=divisors%20is%20%28a,for%20some%20n%202%20that)).) Lucas showed examples of reduced rings illustrating that the McCoy condition lies properly between these related conditions: some rings are McCoy but fail (a.c.), and conversely some satisfy (a.c.) but are not McCoy ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=element%20t%202%20R%20such,that%20are%20not%20McCoy%20rings)). This highlighted how subtle the McCoy property can be in rings with zero divisors. \n\nThe specific conjecture in question first appeared explicitly as **Problem 9** in a 2014 survey of open problems in commutative ring theory by Cahen, Fontana, Frisch, and Glaz ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Does%20there%20exist%20an%20integrally,is%20not%20locally%20a%20domain)). The authors combined Akiba’s results and example to ask the next natural question: could one drop the assumption that $R$ is “locally a domain”? In Akiba’s counterexample, $R$ was locally a domain everywhere (each $R_M$ was a domain), whereas the conjecture asks for a more pathological $R$ where some localization has two or more minimal prime components. The motivation was clear – if such an $R$ exists, then *locally* everything looks nice (each local piece is a normal McCoy ring), yet *globally* $R$ would have interacting components that cause it to fail the McCoy property. This would be a striking example, showing that even very strong local integrality and annihilator conditions do not glue together to a global condition. If no such $R$ exists, it would mean these local hypotheses secretly force a stronger global structure (perhaps forcing $R$ to be McCoy or even forcing $R$ to be a domain in disguise). Thus, the conjecture probes the boundary between local and global behavior in commutative algebra, especially in the presence of zero divisors. It emerged from efforts to understand polynomial integrality in the non-domain setting and remains an intriguing open problem in that context ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Does%20there%20exist%20an%20integrally,is%20not%20locally%20a%20domain)).\n\n## 3. Mathematical Analysis  \n**Definitions and Notation:**  The conjecture involves a few specialized terms from commutative algebra which we clarify here. A ring $R$ is **reduced** if it has no nilpotent elements (equivalently, the intersection of all its prime ideals is $(0)$). Being **integrally closed** for a *non-domain* ring means that each of its “irreducible components” is integrally closed in its own field of fractions. More formally, $R$ is integrally closed (sometimes called **normal**) if for every prime ideal $P$, the localization $R_P$ is an integrally closed domain ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=has%20a%20nonzero%20annihilator,2%2C%20Corollary%201.3%5D.%20In)). In practice, this means $R$ can be written as an intersection of integrally closed domains. For example, a finite direct product of integrally closed domains is an integrally closed reduced ring. The condition that $R_M$ is integrally closed for each maximal ideal $M$ simply restates this normality on a local level. \n\nA **McCoy ring** is defined by an annihilator condition on zero divisors. Let $Z(R)$ denote the set of zero divisors of $R$. By definition, $R$ is McCoy if **every finitely generated ideal $I$ that intersects $Z(R)$ has a nonzero annihilator** ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Problem%209,2%2C%20Corollary%201.3%5D.%20In)). Equivalently, whenever $I = (a_1,\\dots,a_n)$ and some $a_i$ is a zero divisor in $R$, there exists a nonzero $r\\in R$ such that $rI = \\{ra_1,\\dots,ra_n\\} = \\{0\\}$ (so $r$ kills all generators of $I$). This condition can be shown to be equivalent to McCoy’s original polynomial criterion: if $f(x),g(x)\\in R[x]$ are polynomials such that $f\\cdot g = 0$ in $R[x]$, then some coefficient of $f$ has a nonzero annihilator intersecting the set of coefficients of $g$, or vice versa. Intuitively, the McCoy property prevents “unrelated” zero divisors from collectively causing a zero product – at least one of them must already individually be annihilated by something. A simple example: in the ring $R = k[x,y]/(xy)$ (coordinate ring of two axes crossing), take the ideal $I=(x,y)$. Here $x$ and $y$ are zero divisors (since $x\\cdot y=0$ in $R$), yet **no** single nonzero element of $R$ annihilates both $x$ and $y$. (For instance, $\\operatorname{Ann}(x)= (y)$ and $\\operatorname{Ann}(y)=(x)$, but any single $r\\neq 0$ fails to kill one of $x,y$.) Thus $I$ has no nonzero annihilator, and indeed $R=k[x,y]/(xy)$ is *not* a McCoy ring. This illustrates the definition. \n\nThe conjecture asks for an $R$ with two properties that significantly constrain its structure locally, while allowing wild behavior globally: (1) **Each $R_M$ is an integrally closed McCoy ring.** Here $M$ ranges over maximal ideals of $R$. So for every maximal $M$, the local ring $R_M$ has the McCoy property and no integrality defects (it’s normal). In particular, each $R_M$ must be *either* a domain or at least a local ring that is a “normal crossing” of domains. (Note that if a local ring has more than one minimal prime, it is not a domain, but it could still be integrally closed in the total ring of fractions – roughly meaning the local ring is an intersection of a few DVRs or such.) (2) **$R$ is not locally a domain.** This means there exists at least one maximal ideal $M_0$ such that $R_{M_0}$ is *not* a domain. Equivalently, $R$ has at least one maximal ideal containing two or more distinct minimal primes of $R$. In geometric language, the spectrum of $R$ has at least one point where two irreducible components meet. At that point, the local ring $R_{M_0}$ has multiple branches (“components”) but is supposed to be integrally closed and has the McCoy property by (1). \n\nCombining these, the sought-after $R$ would be quite remarkable: around each maximal point, $R$ behaves like a “nice” ring (normal and McCoy), yet globally $R$ is neither a McCoy ring nor a disjoint union of domains. If found, such an example would demonstrate a new level of subtlety in local-global principles for commutative rings. On the other hand, if one can prove no such $R$ exists, it would mean that the combination of local integrality and McCoy conditions automatically forces a stronger global property that we haven’t identified explicitly (perhaps forcing $R$ itself to be McCoy or to decompose without interaction between components). \n\n**Best Known Results:** Partial progress comes from the earlier results of Akiba and others. We already have: \n\n- *Akiba’s Theorem (1980):* If $R$ is an **integrally closed, reduced McCoy ring**, then $R[X]$ is integrally closed ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=has%20a%20nonzero%20annihilator,2%2C%20Corollary%201.3%5D.%20In)). This was a positive result showing that under those hypotheses on $R$, adding an indeterminate preserves integrality of the polynomial ring. \n\n- *Akiba’s Corollary (1980):* If $R_M$ is an **integrally closed domain for every maximal $M$**, then $R[X]$ is integrally closed ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=reduced%20McCoy%20ring%2C%20then%20the,2%2C%20Corollary%201.3%5D.%20In)). In other words, if $R$ is *locally* a domain and $R$ has no integrality defects locally, then $R[X]$ remains integrally closed. (One can summarize these two results in the contrapositive: if $R[X]$ fails to be integrally closed, then either $R$ was not integrally closed or some maximal localization $R_M$ was not a domain or not McCoy ([www.ams.org](https://www.ams.org/proc/1989-105-04/S0002-9939-1989-0942636-0/#:~:text=Unlike%20the%20situation%20when%20dealing,is%20integrally%20closed%20if%20and)) ([www.ams.org](https://www.ams.org/proc/1989-105-04/S0002-9939-1989-0942636-0/#:~:text=%24R%24%20is%20an%20integrally%20closed,right%20%5D%24.%20References)).) \n\nFrom these, one can deduce a useful combination: if $R$ is a reduced ring such that **each $R_M$ is an integrally closed McCoy ring**, then $R[X]$ is integrally closed ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=integrally%20closed%20domain%20,not%20a%20McCoy%20ring%20and)). This statement appears in Huckaba’s 1988 monograph and the 2014 survey, and it essentially uses Akiba’s two conditions in tandem: each $R_M$ integrally closed *and* (because $R_M$ is McCoy) $R$ itself is “locally McCoy.” Under those assumptions, polynomial extension preserves integrality ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=integrally%20closed%20domain%20,not%20a%20McCoy%20ring%20and)). The open conjecture asks for an $R$ satisfying exactly these local assumptions, but where $R$ itself fails to be McCoy (so the “local McCoy” condition does not glue up to a global McCoy condition) and moreover $R$ is not locally a domain. **No known ring so far breaks this local-global link.** \n\nA **partial counterexample** was already given by Akiba ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=maximal%20ideal%20M%20%2C%20then,78%2C%20page%20103)): he constructed a *reduced ring $R$ that is not McCoy, yet is locally an integrally closed domain.* In that example, every maximal ideal picks out a single irreducible component (so $R$ is *locally a domain*), and each such local domain is trivially a McCoy ring (since domains have no nonzero zero-divisors, the McCoy condition holds vacuously). Thus Akiba’s example fulfilled all conditions except the “not locally a domain” clause. It showed that the global McCoy property can fail even under very strong local conditions *if the ring’s components do not overlap at maximal ideals*. Roughly, Akiba’s construction took two integrally closed domains and “glued” them together in a certain way such that globally an ideal needed both components to annihilate it. One can imagine $R$ as something like an intersection $A\\cap B$ inside a common field of fractions, where $A$ and $B$ are integrally closed subrings that share no common annihilator. (A concrete realization of such an $R$ can be made using a fiber product or amalgamation of rings. For instance, one can take $A$ and $B$ to be integrally closed subrings that coincide on a large subring but diverge elsewhere, producing a reduced ring with two minimal primes and complicated intersections.) Akiba’s specific example (as cited in ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=maximal%20ideal%20M%20%2C%20then,78%2C%20page%20103))) demonstrated that local integrality plus local domain conditions are not enough to force the McCoy property globally. \n\nThe **new difficulty** in the open problem is to allow $R$ to have a maximal ideal where two components meet (so $R_{M_0}$ is not a domain) while still insisting each such $R_{M}$ remains McCoy and integrally closed. If such an $R$ exists, it means *even at a singular point where components intersect, the ring behaves “nicely” (normal and McCoy) in the local sense*, yet somehow the interaction across that point causes a global McCoy failure. One intuitive way this could happen is if $R$ has (at least) two minimal prime ideals $P_1\\neq P_2$ that are both contained in a single maximal $M_0$. Locally at $M_0$, the ring $R_{M_0}$ would have exactly $P_1R_{M_0}$ and $P_2R_{M_0}$ as minimal primes; being integrally closed imposes that each $P_iR_{M_0}$ corresponds to an integrally closed local domain (e.g. a DVR or a rank-1 valuation domain perhaps), and being McCoy locally means any zero divisors in $R_{M_0}$ have local annihilators. Globally, however, one could imagine an ideal $I = (a,b)\\subset R$ where $a\\in P_1$, $b\\in P_2$ – so $a$ and $b$ are zero divisors supported on different components – that has no single annihilator in $R$. Locally at $M_0$ there might be an element killing $a$ and another killing $b$, but no element of $R$ kills both simultaneously because $a$ and $b$ “live” on separate components of $R$. This is exactly the behavior needed to violate the McCoy condition globally. In our earlier example $k[x,y]/(xy)$, $x$ and $y$ lie in distinct minimal primes and $(x,y)$ had no single annihilator, but that ring failed the local integrality condition at the intersection. The challenge is to achieve a similar scenario **while maintaining integrality (normality) locally**. \n\n**Current Status (True/False?):** As of the latest literature, the conjecture remains **open**. No one has yet exhibited a ring with all the required properties, nor proven that none can exist ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Does%20there%20exist%20an%20integrally,is%20not%20locally%20a%20domain)). The consensus is that if an example exists, it will likely be highly nontrivial and probably non-Noetherian. Many familiar classes of rings have been checked and are known not to provide such an example. For instance, if $R$ is *Noetherian* (satisfies the ascending chain condition on ideals), the combination of conditions tends to force a stronger conclusion. In fact, in most well-behaved (Noetherian or finitely generated) rings, if every maximal localization is integrally closed and satisfies McCoy, then either $R$ is already a domain or one can often deduce $R$ itself is McCoy. (While a full theorem along these lines has not been published, this is supported by the absence of counterexamples in those categories and partial results in special cases.) So any counterexample $R$ will likely be a somewhat pathological ring, possibly of infinite character or constructed by an infinite process. Conversely, no one has proven that such pathologies are impossible – it could be that an ingenious construction (perhaps using valuation theory or infinite fiber products) eventually produces the desired ring. \n\n**Known True Special Cases:** One can say the conjecture is **vacuously true** for domains – if $R$ is a domain, then the condition “$R_M$ is integrally closed McCoy for each $M$” holds (since $R_M$ is a domain, integrally closed if $R$ is integrally closed, and McCoy holds trivially as there are no nonzero zero-divisors). But in that case $R$ itself is McCoy (again trivially) and also locally a domain, so it does not satisfy the *negation* part of the conjecture. Thus domains are not counterexamples; they are rather the trivial case where nothing fails. For **discrete examples**: a direct product of two integrally closed domains, say $R = A \\times B$ (with $A,B$ normal domains), *almost* works: it is reduced and integrally closed; each maximal ideal ($M_A = A\\times 0$ or $M_B = 0\\times B$) yields a localization isomorphic to one of the domains (hence integrally closed McCoy); and $R$ itself is not a domain. However, $R=A\\times B$ is *locally a domain*: it has two maximal ideals and each localization picks out one component (so there is no maximal containing both minimal primes). Thus $A\\times B$ fails the “not locally a domain” requirement. Indeed, in $A\\times B$ any finitely generated ideal that contains zero divisors from both $A$ and $B$ (like $(1,0)$ and $(0,1)$) will fail to have a single annihilator, meaning $A\\times B$ is not McCoy – but the local condition (1) actually breaks at the single maximal that does not exist (there is no maximal containing both (1,0) and (0,1)). This indicates that the conjecture demands a ring that is *not* a simple direct product decomposition – the components must intersect in a single maximal to create the needed tension. \n\nIn summary, **no counterexample is known** to date. All known rings that satisfy the stringent local hypotheses have turned out to either be globally McCoy or to be locally a domain after all. Researchers have produced related examples (like rings that are locally domains but not McCoy, or rings that are nearly McCoy except for a specific missing condition ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=element%20t%202%20R%20such,that%20are%20not%20McCoy%20rings))), but the exact combination in Problem 9 has eluded resolution. The conjecture thus remains an important open problem, capturing a delicate interplay between local normality and global zero-divisor behavior.\n\n## 4. Techniques & Methodology  \n**Key Techniques Used:** Approaches to this problem draw on both constructive methods in ring theory and theoretical constraints from commutative algebra. On the constructive side, one promising method is the use of **fiber products (amalgamated sums)** of rings. A fiber product $R = A\\times_C B$ (with $A,B$ sharing a common factor $C$) can produce rings with prescribed behavior at certain primes. By choosing $A$ and $B$ to be integrally closed domains and gluing them along a subring $C$, one can create a reduced ring $R$ with exactly two minimal primes (coming from $A$ and $B$) that intersect at a single maximal ideal (the ideal corresponding to $C$). Such constructions are classic in creating rings that are *not* locally domains. The challenge is to maintain the McCoy condition locally; this often means arranging that the overlap $C$ is large enough that in the localization $R_M$ the two components $A$ and $B$ don’t introduce new zero divisors beyond those coming from $C$. Techniques from *ideal theory* and *extension of valuations* come into play here. For instance, integrally closed rings can be characterized as intersections of **valuation domains**, so one strategy is to take two valuation domains (which are integrally closed) and have them share one maximal ideal in common (so that locally at that maximal, the ring looks like the intersection of two valuation domains – often a valuation intersection remains integrally closed). By fine-tuning such an example, one hopes to achieve a ring where each local “branch” is valuation-like (hence McCoy, since valuations are coerced strongly by their one-dimensional structure) but their intersection globally fails to be McCoy. This approach leverages known results in star operations and semistar operations – tools used to study intersections of overrings and integral closures ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=5,Heinzer%2C%20On%20the%20generalized)) ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=theorem%20and%20Krull%20domains,Austral)). Indeed, concepts like * Prüfer domains*, *PvMDs*, and other generalized GCD domains suggest how to glue integrally closed pieces while controlling zero divisors.  \n\nAnother technique comes from analyzing **annihilator conditions via homological algebra**. The McCoy condition and its relatives ((A), (a.c.), etc.) can be studied using the language of modules and ideals. For example, Lucas’s property (a.c.) was formulated as a condition on annihilator ideals of pairs of elements ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=divisors%20is%20%28a,for%20some%20n%202%20that)). One may attempt to prove an impossibility result (that no such $R$ exists) by assuming $R$ satisfies all the local conditions and then deducing a contradiction. This could involve analyzing the structure of zero divisors. In a ring where each local is McCoy, certain diagrams of zero divisors cannot occur. Techniques like the **zero-divisor graph** (which encodes how zero divisors multiply to zero) and conditions like *reversible* or *2-primal* rings are relevant. In fact, recent papers study rings where any product of zero divisors in any order still gives zero (reversible, symmetric rings) ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Definition%201,all%20a%2C%20b%20%E2%88%88%20R)), and these often imply McCoy. Ensuring each localization is McCoy might impose that $R$ has some global “almost commutativity” or symmetrization property that could force McCoy globally. To explore this, one uses **ideal contraction and extension** and localization arguments: if each $R_M$ has a nonzero annihilator for every troublesome ideal, can we patch them together to get a global annihilator? This often comes down to using partition of unity arguments (gluing local sections), which in algebraic terms is related to idempotents or the Chinese remainder theorem. If $R$ were the sum of its components (like $A\\times B$ has orthogonal idempotents $e=(1,0), 1-e=(0,1)$), then it’s easy to produce global annihilators by combining local ones. The desired example, however, disallows idempotent decomposition (since it’s not locally a domain at one maximal, it’s a connected intersection of components). Hence one must operate without the luxury of central idempotents. Instead, one might use *spectral sequence arguments in local cohomology* or *lattice-of-ideals arguments* to see how local annihilators might fail to globalize. These are advanced techniques, but the idea would be to assume a global ideal $I=(a,b)$ needs an annihilator and derive conditions that force either $a$ or $b$ to lie in every maximal (contradiction with them being supported in separate components). \n\n**Transferability of Techniques:** The methods employed here are not unique to this problem; they intersect with other active areas of commutative algebra. For example, **construction of exotic examples** via fiber products has been used to answer many open questions about rings (Krempa (1996) famously constructed reduced rings with various combinations of properties as counterexamples ([eudml.org](https://eudml.org/doc/299229#:~:text=23,345.%20%282016%29%C2%A0Zbl1334.16019MR3393464DOI10.1016%2Fj.jpaa.2015.06.015))). Such constructions have also been applied in factorization theory and ideal theory. Similarly, **annihilator conditions** (McCoy, (A), (a.c.), etc.) are studied in the context of *Armendariz rings* and *NI rings* (rings where nilpotent elements have certain diagonal behavior). Results by Camillo and Nielsen (2008) on “zero-divisor graphs” and conditions like reversible, symmetric, and Armendariz rings ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Definition%201,all%20a%2C%20b%20%E2%88%88%20R)) ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=2%20VICTOR%20CAMILLO%20AND%20PACE,commutative%20%2B3%20symmetric%20KS%20reduced)) show the interplay between multiplicative conditions and annihilators. These techniques have been fruitful in noncommutative ring theory as well (where left/right McCoy differences arise). \n\nAnother tool relevant here is **localization and completion**: sometimes to construct a weird ring, one localizes or completes a known ring in a way that adds zero divisors. For instance, taking a direct limit (colimit) of rings or a completion can yield new zero divisors (e.g. the completion of a domain can acquire zero divisors if the domain wasn’t $I$-adically separated). These processes can preserve integrally closedness in many cases, but controlling the McCoy property through them is tricky. Still, researchers might explore inverse limits of known McCoy rings or subring constructions (like taking the intersection of a family of McCoy domains) to see if the limit ring retains local McCoy but loses global McCoy. All these demonstrate that the search for a counterexample is intertwined with a variety of construction techniques in commutative algebra. Conversely, any **theoretical proof of nonexistence** would likely involve clever use of localization and ideal theory to show that local McCoy + normal implies some global idempotent or global annihilator must exist. That would require synthesizing the local data via algebraic patching arguments – a methodology similar to proving that certain Čech cohomology vanishes or certain glueing of invertible ideals is possible (techniques familiar in Grothendieck’s patching approach). In summary, the problem sits at a crossroads of constructive and abstract techniques in algebra: it challenges one to either build a very counterintuitive ring or to prove a new structural theorem about how local annihilator conditions globalize. \n\n## 5. Bibliography  \n1. **T. Akiba (1980)** – *“Integrally-closedness of polynomial rings,”* **Japan. J. Math.** 6 (1980), 67–75. **–** This is the groundbreaking paper that first linked the integrality of $R[X]$ to conditions on $R$ when $R$ has zero divisors. Akiba proved that if $R$ is a reduced, integrally closed McCoy ring, then $R[X]$ is integrally closed ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Problem%209,2%2C%20Corollary%201.3%5D.%20In)). He also gave a pivotal example of a reduced ring that is locally a domain (hence integrally closed locally) but not a McCoy ring ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=maximal%20ideal%20M%20%2C%20then,78%2C%20page%20103)). Akiba’s work provided the foundation and motivation for the conjecture in question, highlighting the delicate balance between local properties and polynomial extensions ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=has%20a%20nonzero%20annihilator,2%2C%20Corollary%201.3%5D.%20In)) ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=integrally%20closed%20domain%20,not%20a%20McCoy%20ring%20and)). \n\n2. **J. A. Huckaba (1988)** – *“Commutative Rings with Zero Divisors,”* Marcel Dekker, 1988. **–** Huckaba’s monograph is a comprehensive study of commutative rings that are not domains, focusing on integrality and factorization. In Chapter 3, he discusses conditions for polynomial rings to be integrally closed and cites Akiba’s results. Notably, on page 103, Huckaba observes that if every maximal localization $R_M$ is an integrally closed McCoy ring, then $R[X]$ is integrally closed ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=integrally%20closed%20domain%20,not%20a%20McCoy%20ring%20and)). This book framed the open question by asking if the converse can fail: can $R$ satisfy those local conditions without itself being McCoy? Huckaba’s text is a key reference for understanding the state of knowledge up to the late 1980s and provides context for why the open problem is natural.\n\n3. **T. G. Lucas (1986)** – *“Two annihilator conditions: property (A) and (a.c.),”* **Comm. Algebra** 14 (1986), 557–580. **–** In this paper, Lucas defines and studies two conditions ((A) and (a.c.)) that strengthen or relate to the McCoy property. Property (A) requires every individual zero divisor to have a nonzero annihilator, while (a.c.) (short for “annihilator condition”) requires that for any $r,s\\in R$ there exists $t$ with $\\mathrm{Ann}(r,s)=\\mathrm{Ann}(t)$ ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=divisors%20is%20%28a,for%20some%20n%202%20that)). Lucas shows how these conditions compare: for example, he provides examples of reduced McCoy rings that do not satisfy (a.c.), and rings satisfying (a.c.) that are not McCoy ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=element%20t%202%20R%20such,that%20are%20not%20McCoy%20rings)). His work is important for the conjecture because it explores the landscape of rings “near” the McCoy condition. The open problem essentially asks for a ring that is locally McCoy (so, very strong annihilator behavior locally) yet globally fails McCoy – Lucas’s results illustrate how tricky it is to maintain the annihilator property globally, thereby underlining the difficulty of the conjecture. \n\n4. **P.-J. Cahen, M. Fontana, S. Frisch, and S. Glaz (2014)** – *“Open Problems in Commutative Ring Theory,”* in **Commutative Algebra: Recent Advances** (Springer, 2014). **–** This book chapter (pp. 353–362) explicitly states the conjecture as Problem 9 ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Does%20there%20exist%20an%20integrally,is%20not%20locally%20a%20domain)). It provides the precise formulation and background: it recalls Akiba’s theorems and example ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Problem%209,2%2C%20Corollary%201.3%5D.%20In)) ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=maximal%20ideal%20M%20%2C%20then,78%2C%20page%20103)), then poses the question of the existence of an integrally closed reduced ring which is locally McCoy everywhere but not McCoy globally and not locally a domain ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=Does%20there%20exist%20an%20integrally,is%20not%20locally%20a%20domain)). The chapter serves as the primary reference for the conjecture’s current status (open) and is a go-to source for researchers looking for important unanswered questions in the domain of rings with zero divisors. It also lists related open problems (e.g., Problem 10 and 11 on other annihilator conditions ([paperzz.com](https://paperzz.com/doc/7140134/open-problems-in-commutative-ring-theory#:~:text=element%20t%202%20R%20such,that%20are%20not%20McCoy%20rings))), situating this conjecture in a broader context. An annotation explains that a solution would either produce a long-sought counterexample or prove a new structural theorem. \n\n5. **V. Camillo & P. P. Nielsen (2008)** – *“McCoy rings and zero-divisors,”* **J. Pure Appl. Algebra** 212 (2008), 599–615. **–** This more recent paper studies the McCoy property in both commutative and some noncommutative settings, providing a modern perspective. Camillo and Nielsen develop a “zero-divisor graph” and show implications between various ring properties (Armendariz, reversible, symmetric, etc.) and the McCoy condition ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=Definition%201,all%20a%2C%20b%20%E2%88%88%20R)) ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=2%20VICTOR%20CAMILLO%20AND%20PACE,commutative%20%2B3%20symmetric%20KS%20reduced)). They include a diagram of implications and pose questions about whether certain classes of rings must be McCoy. While not directly solving the integrally closed conjecture, their work offers techniques (like graph-theoretic views of zero divisors and use of the Diamond Lemma for reductions) that might be applicable. They also leave some McCoy-related questions open in their conclusion, reflecting that the theory is far from complete ([paperzz.com](https://paperzz.com/doc/8678781/mccoy-rings-and-zero-divisors-1.-introduction-and#:~:text=The%20following%20diagram%20shows%20all,commutative%20%2B3%20symmetric%20KS%20reduced)). This article is a useful reference for anyone attempting the conjecture, as it provides insight into how zero divisors can be arranged without violating McCoy, and what structural features seem necessary for a McCoy failure. The techniques here could inform either a construction or a no-go proof for the conjecture.\n\n**Additional References:** Researchers interested in this problem may also consult J. Krempa (1996) *“Some examples of reduced rings,”* Algebra Colloq. 3, 289–300, for methods of constructing exotic reduced rings, and recent work like P. Danchev & M. Zahiri (2025) *“Some New Classes of Rings Which Have the McCoy Condition,”* arXiv:2504.18224, which explores modern generalizations of McCoy rings (such as *weakly reversible rings*) ([arxiv.org](https://arxiv.org/abs/2504.18224#:~:text=We%20define%20here%20the%20notion,R%24%20is%20zip%20if%2C%20and)). These works, while not solving the conjecture, expand the toolbox of ring constructions and properties that one might draw upon in the quest to resolve this deep open question. The prevailing view is that resolving the conjecture – either by finding the elusive example or proving none can exist – will likely require a clever synthesis of such construction techniques with theoretical constraints. Until then, the problem remains a tantalizing target at the frontier of commutative ring theory."
  },
  {
    "content": "Let $k$ be a field, $A$ be a finite dimensional (not necessarily commutative) $k$-algebra. Prove that there exists a integer $d$, such that for every $A$-module $M$ that has $M$ has finite projective dimension, then the projective dimension of $M$ is less than or equal to $d$.",
    "research": "# Executive Summary\n**Conjecture Name:** *Finitistic Dimension Conjecture* – specifically the **“Little” Finitistic Dimension Conjecture** for finite-dimensional algebras. This conjecture asserts that for any finite-dimensional algebra $A$ over a field $k$, there is a uniform bound on projective resolution lengths: in other words, there exists some integer $d$ (depending on $A$) such that every $A$-module with finite projective dimension has projective dimension $\\le d$ ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=situation%20there%20are%20conjectures%20which,most%20general%20one%2C%20and%20it)). Equivalently, the *finitistic projective dimension* of $A$ (the supremum of $\\mathrm{pd}(M)$ over all modules $M$ with $\\mathrm{pd}(M)<\\infty$) is finite. Despite extensive efforts over decades, this conjecture remains **open** in general. No counterexample is known – it is one of the most prominent unsolved problems in homological algebra and representation theory of Artin algebras ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=in%20mathematics%20in%20general,the%20summer%20school%2C%20and%20we)) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=The%20little%20finitistic%20dimension%20being,the%20Nunke%20condition%2C%20which%20in)). Only special cases have been proven, and the conjecture’s truth would have far-reaching consequences (it implies several other homological conjectures). Conversely, a related “stronger” conjecture was found to be false (there are algebras where certain modules have infinite projective dimension even though *all* finite-dimensional modules have bounded projective dimension ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=,2622))). Overall, the finitistic dimension conjecture stands as a central open question, with partial progress but no full solution as of today.\n\n# Historical Context\n**Origin and Motivation:** The finitistic dimension conjecture emerged in the late 1950s and early 1960s, a period when algebraists were generalizing homological methods from topology and group theory to ring theory ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=parallel%20theories%20of%20cohomology%20were,The%20homological)). In 1960, Hyman **Bass** introduced the concept of “finitistic dimension” in his seminal paper *“Finitistic Dimension and a Homological Generalization of Semi-Primary Rings”* (Trans. AMS, 1960) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=,algebra%2C%20Princeton%20University%20Press%2C%201956)). Bass and his contemporaries were influenced by earlier work in homological algebra (notably the Cartan–Eilenberg framework ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=parallel%20theories%20of%20cohomology%20were,The%20homological))) and by foundational conjectures of Rosenberg-Zelinsky, Nakayama, and Nunke on homological dimensions ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=Cartan%20and%20Eilenberg%20in%20,no%20unified%20approach%20towards%20these)). A key motivation was the success in the **commutative** setting: Bass, along with Gruson and Raynaud, had proved that for any commutative Noetherian ring $R$, the supremum of projective dimensions of finite-length modules equals the ring’s Krull dimension ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=the%20projective%20dimension%20of%20M%2C,Generalized%20Nakayama%20conjecture%20For)). (In particular, commutative rings never exhibit an “infinite” finitistic dimension – it’s either bounded by $\\dim R$ or the ring has finite global dimension in the regular case.) This result, together with the Auslander–Buchsbaum–Serre theorem linking finite global dimension to regularity ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=Around%20the%20middle%20of%20this,modules)), spurred algebraists to ask if *every* finite-dimensional (Artin) algebra might similarly have a finite finitistic dimension. The conjecture was formulated in this generality in the 1960s (often credited to Bass and later popularized by Maurice Auslander and others). It became part of a broader program of “homological conjectures” in the representation theory of algebras – a collection of hypotheses characterizing rings via homological invariants ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=Cartan%20and%20Eilenberg%20in%20,no%20unified%20approach%20towards%20these)) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=situation%20there%20are%20conjectures%20which,most%20general%20one%2C%20and%20it)). By the 1970s, the finitistic dimension conjecture was well known as one of the major open problems in the field, sometimes referred to as the “*Little* Finitistic Dimension Conjecture” to distinguish it from a stronger (now disproven) variant ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=situation%20there%20are%20conjectures%20which,most%20general%20one%2C%20and%20it)).\n\n**Original Context:** In Bass’s work and subsequent discussions, the conjecture was seen as a natural generalization of properties of group algebras and commutative rings. For example, group cohomology provided early examples of rings (group algebras of finite groups) where cohomological/projective dimensions are finite, inspiring the question in general. Bass showed in 1960 that certain homological dimensions coincide with classical invariants in the commutative case, and asked whether the *finitistic projective dimension* of any artinian ring is finite ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=the%20projective%20dimension%20of%20M%2C,Generalized%20Nakayama%20conjecture%20For)). The *semi-primary rings* mentioned in Bass’s title are precisely finite-dimensional algebras with nilpotent Jacobson radical; the conjecture in this context would imply a strong form of homological regularity for such rings. In summary, the conjecture originated from attempts to classify rings by homological criteria (generalizing the notion of “regular ring” to possibly noncommutative settings) and has been part of the folklore since around 1960.\n\n# Mathematical Analysis\n\n### Definitions and Notation \n- **Projective Dimension ($\\mathrm{pd}\\,M$):** For a module $M$ over a ring $A$, the projective dimension is the length $n$ of the shortest projective resolution $0 \\to P_n \\to \\cdots \\to P_0 \\to M \\to 0$. If no finite projective resolution exists, $\\mathrm{pd}\\,M = \\infty$. “$M$ has finite projective dimension” means such an $n$ exists (equivalently $\\mathrm{pd}\\,M < \\infty$). \n\n- **Global Dimension:** The (right) global dimension of $A$ is $\\sup\\{\\mathrm{pd}\\,M \\mid M \\text{ any right $A$-module}\\}$. If any module has infinite projective dimension, the global dimension is infinite. For example, a ring is *hereditary* if global dimension $\\le 1$, and *regular* (in the commutative sense) if global dimension equals the Krull dimension of the ring ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=Around%20the%20middle%20of%20this,modules)).\n\n- **Finitistic Dimension:** There are two closely related invariants. The *big finitistic dimension* $\\operatorname{Fin.dim}A$ is the supremum of $\\mathrm{pd}\\,M$ over **all** modules $M$ that have finite projective dimension. The *little finitistic dimension* $\\operatorname{fin.dim}A$ is the supremum of $\\mathrm{pd}\\,M$ over all **finitely generated** (or equivalently finite-length) modules $M$ with finite projective dimension ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=variety,formulated%20for%20a%20finite%20dimensional)). For finite-dimensional algebras (Artin algebras), one usually considers finitely generated modules, so $\\operatorname{fin.dim}A$ is the relevant quantity. The conjecture can thus be stated as: **For every finite-dimensional $k$-algebra $A$, $\\operatorname{fin.dim}A < \\infty$.** The user’s statement is equivalent to this, since if $d = \\operatorname{fin.dim}A$ is finite, it means every module $M$ with finite $\\mathrm{pd}$ satisfies $\\mathrm{pd}\\,M \\le d$. Note that if *no* non-projective module has finite projective dimension (a pathological case), the statement holds trivially with $d=0$ or 1. Usually, however, there do exist some finite-dimensional modules of finite projective dimension, and the conjecture asserts a uniform upper bound on their resolution lengths.\n\n- **Connections to Other Notions:** If $A$ has *finite global dimension*, then obviously $\\operatorname{fin.dim}A$ is finite (in fact $\\operatorname{fin.dim}A = \\mathrm{gldim}\\,A$ in that case). Finite global dimension is a very strong condition – for commutative algebras it characterizes regular rings. The finitistic dimension conjecture asks something much weaker: even if $A$ is far from regular (perhaps $\\mathrm{gldim}\\,A = \\infty$), do the “nice” modules (those that *do* happen to have finite resolutions) collectively have a longest resolution length? In commutative algebra, this turned out to be true: Bass proved that for a Noetherian ring, the supremum of finite projective dimensions is actually equal to the Krull dimension ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=the%20projective%20dimension%20of%20M%2C,Generalized%20Nakayama%20conjecture%20For)). In particular, commutative Noetherian rings always have finite finitistic dimension (either it equals the Krull dimension, or in the regular case the fin.dim is actually realized by a maximal Cohen–Macaulay module and equals the ring’s dimension). The conjecture is thus a direct generalization of this fact to *noncommutative* algebras, especially Artin algebras. It is also related to group cohomology: for group algebras $kG$, finite projective dimension modules correspond to groups of finite cohomological dimension. The conjecture holding for $kG$ (with $G$ finite) is true, since $\\mathrm{gldim}\\,kG < \\infty$ in that case, but for general (infinite) groups it connects with questions in group theory. However, the classical formulation restricts to finite-dimensional algebras (Artin algebras), since without finiteness conditions counterexamples can be found (even certain commutative non-Noetherian or infinitely generated algebras can have infinite finitistic dimension).\n\n- **Relationship to Other Conjectures:** The finitistic dimension conjecture is the most general (and believed to be the hardest) in a family of homological conjectures for Artin algebras ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=situation%20there%20are%20conjectures%20which,most%20general%20one%2C%20and%20it)). For instance, it implies the **Nunke Condition** and the **Generalized Nakayama Conjecture** as special cases ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=k,Furthermore)). (Roughly, Nunke’s condition and Nakayama’s conjectures predict existence of non-zero Ext in high degrees for certain module pairs, which would follow if fin.dim$A$ is finite for all algebras ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=k,Furthermore)).) In fact, the conjectures are known to be logically linked: a proof of finitistic dimension finiteness would settle those others. Historically, a “First Finitistic Dimension Conjecture” was also posed, asking whether $\\operatorname{Fin.dim}A = \\operatorname{fin.dim}A$ for all Artin algebras (i.e. whether allowing infinitely generated modules changes the supremum). **This stronger conjecture was disproven**: there are examples where infinitely generated modules have larger projective dimensions than any finite module. In 1992, Zimmermann-Huisgen demonstrated a “homological domino effect” yielding an infinite strictly increasing chain of projective dimensions ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=rings%2C%20Notes%20by%20Claus%20Michael,383)). Later, S.O. **Smalø** (1998) constructed Artin algebras for which $\\operatorname{fin.dim}A$ is finite (say = $n$) but $\\operatorname{Fin.dim}A$ is infinite ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=,2622)). In these examples, every finite-length module has projective dimension $\\le n$, yet there exist some bizarre, infinitely generated modules with projective dimension beyond $n$ (in fact unbounded). Thus $\\operatorname{Fin.dim}A \\neq \\operatorname{fin.dim}A$ in those cases, refuting the “(a)” version of the conjectures ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=situation%20there%20are%20conjectures%20which,module%20M%20there%20exists)). Fortunately, this does not contradict the standard conjecture (b), which only concerns the finiteness of $\\operatorname{fin.dim}A$ itself. In all known examples, whenever $\\operatorname{fin.dim}A$ has been computed it turned out finite; no algebra is known where $\\operatorname{fin.dim}A = \\infty$. The conjecture therefore survives in its “little” form. \n\n### Known Results and Partial Proofs \nOver the years, many special cases of the finitistic dimension conjecture have been established. Researchers have identified classes of algebras for which $\\operatorname{fin.dim}A$ can be proven to be finite, often by finding an explicit uniform projective resolution length or by reducing to simpler algebras. Here are some key positive results:\n\n- **Monomial Algebras:** An important breakthrough came in the late 1980s when the conjecture was proved for *monomial algebras*. A monomial algebra is a quotient of a path algebra $kQ$ by an ideal generated by monomials (paths) in the quiver $Q$. In 1991, Green, Kirkman, and Kuzmanovich showed that if $A$ is a finite-dimensional monomial algebra, then indeed $\\operatorname{fin.dim}A$ is finite ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=conjecture%20was%20proved%20for%20monomial,pairs%27%27%20given%20by%20certain%20maps)) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=,50)). They did this by constructing minimal projective resolutions for simple $A$-modules and observing a uniform bound on their lengths. Essentially, the combinatorial structure of monomial relations allows one to compute resolutions explicitly (often using Gröbner basis techniques and combinatorial “periodicity” in the resolution). Independently, Igusa and Zacharia (1990) gave another proof for monomial algebras ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=conjecture%20was%20proved%20for%20monomial,pairs%27%27%20given%20by%20certain%20maps)) by introducing the concept of *syzygy pairs*, which captured cancellations in the resolution and again led to a uniform projective dimension bound. These results were a strong piece of evidence in favor of the conjecture, covering a broad class of (often wild) algebras.\n\n- **Radical Cube Zero Algebras:** Shortly thereafter, attention turned to algebras with restrictions on powers of the Jacobson radical $J$. Green and Zimmermann-Huisgen (1991) proved that if $A$ has **radical cube zero** ($J^3=0$), then $\\operatorname{fin.dim}A < \\infty$ ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=holds%20for%20algebras%20with%20radical,conjecture%2C%20which%20we%20here%20call)). Intuitively, $J^3=0$ means any composition of three non-invertible maps (arrows in the quiver) is zero, which simplifies the projective resolutions considerably. In fact, they established an explicit bound in this case. This result was later re-proved and generalized by Igusa and Todorov, and by others, using different methods. The generalization extended to algebras where higher powers of the radical vanish *and* the factor algebra by a lower power has finite representation type. For example, Draxler and Happel (1992) showed the conjecture holds if $J^{2\\ell+1}=0$ and $A/J^{\\ell}$ is of finite representation type ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=holds%20for%20algebras%20with%20radical,conjecture%2C%20which%20we%20here%20call)). Finite representation type (having only finitely many indecomposable modules up to isomorphism) often forces homological dimensions to be tame. In these scenarios, one can often reduce the problem to analyzing a finite (sometimes hereditary) subalgebra. Collectively, these results cover many “small” algebras (e.g. all algebras with Loewy length $\\le 3$ are settled). \n\n- **Special Classes and Reductions:** Numerous other classes have been verified. For example, the conjecture is trivially true for *hereditary* algebras (global dimension $\\le 1$) and for *Nakayama algebras* (which have well-understood resolutions). It is known to hold for **triangular matrix algebras** (an algebra of the form $\\begin{pmatrix} B & M \\\\ 0 & C \\end{pmatrix}$ has fin.dim bounded by the sum of fin.dim$B$ and fin.dim$C$, under certain conditions). **Rep\\-resentation-finite** algebras, and more generally algebras of *low representation dimension*, also satisfy the conjecture. (Auslander’s notion of **representation dimension** measures how far an algebra is from being of finite representation type. Results by Igusa-Todorov and others have shown that if an algebra’s representation dimension is $\\le 3$, it implies fin.dim is finite – essentially because such algebras admit a special “generator” whose endomorphism algebra has finite global dimension ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0001870809002187#:~:text=References%201.%20,Representation%20Dimension%20of%20Artin%20Algebras)).) Moreover, in recent years the conjecture has been proven for some *extension and localization* classes: for instance, if an algebra can be obtained as a fairly “nice” extension of another known algebra, finiteness is preserved ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/abs/pii/S0022404916301293#:~:text=The%20finitistic%20dimension%20conjecture%20asserts,If%20the%20extension%20is%20right)). A 2015 result by Wang and Xi reduced the general conjecture to a statement about *radical-power extensions*: roughly, it suffices to prove fin.dim is finite for certain extended algebras built from simpler ones ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/abs/pii/S0022404916301293#:~:text=The%20finitistic%20dimension%20conjecture%20asserts,If%20the%20extension%20is%20right)). This means any hypothetical counterexample would have to survive these reduction steps, becoming a minimal counterexample in some category of extensions – a strategy that so far has found no counterexample.\n\n- **No Known Counterexamples:** Crucially, despite extensive computational searches and theoretical efforts, **no counterexample to the conjecture (b)** is known. Every finite-dimensional algebra studied either has been proved to have finite finitistic dimension or remains elusive. In particular, many experts believe the conjecture is true, and work has focused on developing tools to eventually prove it in general (or at least explain why known methods haven’t found a counterexample). The absence of counterexamples even in computer-generated random algebras or in extreme cases (e.g. algebras of high wild representation type) is a positive sign. However, the problem is subtle: it’s not enough for each *individual* module’s projective dimension to be finite – that is usually true – one needs a uniform bound across all finite modules. Counterexamples to the stronger conjecture (big = little) show that wild behavior can occur with infinitely generated modules, but finite modules thus far seem to obey a uniform bound in practice. \n\n### Critical Example: Big vs. Little Finitistic Dimension Gap  \nWhile no algebra is known with truly infinite finitic dimension, it’s instructive to see *how* the stronger version fails. We outline Smalø’s 1998 example in broad strokes (without technical details): He constructed a family of artinian algebras $A$ (of quiver type) such that $\\operatorname{fin.dim}A$ is very small (often 3 or another fixed small integer), yet for each $N>0$ there exists some (infinite-dimensional) $A$-module $M_N$ with $\\mathrm{pd}\\,M_N > N$ ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=,2622)). The construction uses a clever “layering” of projective modules to force longer and longer resolutions for specially tailored modules. Intuitively, one starts with an algebra that has $\\operatorname{fin.dim}=3$ (for example) and then creates a sequence of larger and larger modules by pasting together pieces so that each new module’s resolution requires one more step than the previous. These $M_N$ modules are not finitely generated (they are infinite direct sums of finite modules carefully arranged), so they do not violate the little conjecture. But they demonstrate that no single finite $d$ can bound *all* modules’ projective dimensions if we allow infinite length modules. Thus $\\operatorname{Fin.dim}A$ can be infinite even when $\\operatorname{fin.dim}A$ stays finite. Birge Zimmermann-Huisgen’s earlier work (1992) provided a conceptual framework for this “infinite escalation” – termed a *homological domino effect* ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=rings%2C%20Notes%20by%20Claus%20Michael,383)) – showing how the failure in one degree forces failures in higher degrees for larger and larger modules. This kind of example underscores *why* the conjecture restricts to finite-dimensional modules: without that restriction the statement is false in a dramatic way. It also highlights the difficulty of the problem – even controlling the homological behavior of finite modules is quite non-trivial and requires global techniques.\n\n# Techniques and Methodologies\nResearchers have developed a variety of tools to attack the finitistic dimension conjecture. Because the problem spans module theory, homological algebra, and even category theory, the approaches are diverse. Below we survey some of the key techniques and ideas that have been employed:\n\n- **Explicit Resolution Construction:** Much progress has come from *constructing minimal projective resolutions* for classes of modules. For “nice” algebras (monomial algebras, radical-power-zero algebras, etc.), one can often describe the projective resolution of a simple module in combinatorial terms ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=conjecture%20was%20proved%20for%20monomial,pairs%27%27%20given%20by%20certain%20maps)). For example, in monomial algebras each projective covers a basis of paths, and the differentials in a resolution can be written down using overlaps of monomial relations. By analyzing these differentials, Green–Kirkman–Kuzmanovich were able to bound the length of any resolution ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=conjecture%20was%20proved%20for%20monomial,pairs%27%27%20given%20by%20certain%20maps)). Tools like *Gröbner bases* for path algebras and *Anick’s resolution* (a combinatorial resolution for algebras given by generators and relations) have been invaluable. This explicit approach is very concrete but can get complicated as the algebra’s relations get more involved. Still, it has yielded results for special cases and provides intuition: the conjecture holds in situations where one can “see” a pattern in all resolutions that forces termination by a fixed length.\n\n- **Syzygy and Homological Invariants:** In their work on monomial algebras, Igusa and Zacharia introduced **syzygy pairs**, a technique to study properties of successive syzygies (kernels of differentials in the resolution) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=conjecture%20was%20proved%20for%20monomial,pairs%27%27%20given%20by%20certain%20maps)). By categorizing how these syzygies behave and pairing them up via certain homomorphisms, they could prevent an unbounded growth of projective dimensions. Building on this, Igusa and Todorov later developed new **homological invariants**, such as the $\\phi$-*dimension*, intended to measure the “complexity” of a module category. The $\\phi$-dimension (Igusa–Todorov, 2005) gives an upper bound on $\\operatorname{fin.dim}A$. They conjectured that in fact $\\phi\\text{-dim}(A) = \\operatorname{fin.dim}A$, which would have solved the conjecture if true. However, a recent result by Hanson and Igusa (2019) produced a counterexample to the *$\\phi$-dimension conjecture* ([arxiv.org](https://arxiv.org/abs/1911.00614#:~:text=2019,an%20Artin%20algebra%2C%20now%20known)), showing that $\\phi$-dimension can be strictly smaller than the actual finitistic dimension in some cases. Despite this setback, the introduction of such invariants has been fruitful – they provide new quantitative tools and often simplify proofs of known finiteness results. For example, Igusa–Todorov invariants are used to give elegant proofs that $\\operatorname{fin.dim}A$ is finite for radical^{3}=0 algebras and other special types, by showing $\\phi$-dim is finite there.\n\n- **Lifting to Derived Categories:** A striking approach by Jeremy **Rickard** (2018) uses *derived category theory*. Rickard considered the question: if the category of $A$-modules has certain nice generation properties, does it force resolutions to terminate? Specifically, he investigated whether the **unbounded derived category** $D^b(A)$ is generated by compact objects (or by the injective modules of $A$) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=Institutt%20for%20matematiske%20fag%20Summer,parallel%20theories%20of%20cohomology%20were)). In a landmark result, Rickard showed that if one can demonstrate a certain *triangulated category generation property* for $A$ (roughly, that the *injective* modules generate the derived category as a triangulated category), then the finitistic dimension conjecture holds for $A$. This approach connects the problem to deep homological properties of derived categories and has reinvigorated interest via modern homological algebra. While the generation condition is difficult to verify in general, it holds for many known cases and offers a conceptual angle: the conjecture is equivalent to saying “injectives generate the derived category for every Artin algebra” ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=The%20subject%20This%20page%20is,parallel%20theories%20of%20cohomology%20were)). This ties the problem to Auslander–Reiten theory and – interestingly – to *Hochschild cohomology*. In fact, Auslander had formulated a related conjecture (sometimes called the **Auslander conjecture** in this context) which implies the finitistic dimension conjecture ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=holds%20for%20algebras%20with%20radical,i%7D_%7BA%7D%28X%2CY%29)). Auslander conjectured that for any module $X$, if $\\Ext^i_A(X,Y)=0$ for all sufficiently large $i$, then in fact $\\Ext^i_A(X,Y)=0$ for all $i$ beyond some uniform bound $N$ (depending on $X$). He proved that this statement for the enveloping algebra $A^e$ is equivalent to the finitistic dimension being finite ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=holds%20for%20algebras%20with%20radical,i%7D_%7BA%7D%28X%2CY%29)). Rickard’s work can be seen as operating in a similar spirit but in the derived category language.\n\n- **Reduction Techniques:** A powerful strategy has been to **reduce** the conjecture to “smaller” or “easier” cases. For example, one can attempt to show that if $A$ has a certain complicated structure, it contains or is Morita equivalent to a smaller algebra $B$ for which the conjecture is known. **Idempotent reduction** is one such method: removing an idempotent (which corresponds to cutting down to a full subcategory of representations) can simplify an algebra. A result along these lines by Bravo and Paquette (2019) showed that if $\\Lambda$ is an algebra with a simple module $S$ of finite projective dimension, then one can pass to a certain idempotent quotient of $\\Lambda$ that “reflects” finiteness of the finitistic dimension ([arxiv.org](https://arxiv.org/abs/1902.00317#:~:text=Title%3A%20Idempotent%20reduction%20for%20the,S%24%20of%20finite%20projective%20dimension)). In plain terms, if part of the algebra is well-behaved (has a finite $\\mathrm{pd}$ simple), one can often focus on that part. **Extension and fiber products** of algebras have also been studied: Changchang Xi and others (2015–2018) developed a framework to reduce the conjecture to checking it on extensions where one algebra’s radical fits into another’s structure ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/abs/pii/S0022404916301293#:~:text=The%20finitistic%20dimension%20conjecture%20asserts,If%20the%20extension%20is%20right)). They proved statements like: if $B \\subseteq A$ is an algebra extension such that certain ideals of $B$ are nilpotent in a controlled way, then $\\operatorname{fin.dim}A$ is finite provided $\\operatorname{fin.dim}B$ is finite ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/abs/pii/S0022404916301293#:~:text=The%20finitistic%20dimension%20conjecture%20asserts,If%20the%20extension%20is%20right)). This breaks the problem into potentially simpler sub-problems on subalgebras or quotient algebras. Another recent innovation (2025) is the **monomial arrow removal** technique ([arxiv.org](https://arxiv.org/abs/2506.23747#:~:text=2025,bound%20quiver%20algebras%2C%20and%20show)). Erdmann, Solberg, and collaborators introduced operations on the quiver of an algebra that systematically remove certain arrows (and adjust relations) while preserving the finiteness of finitistic dimension. By applying a sequence of such arrow-removals, one can sometimes reduce an arbitrary algebra to a *monomial* or a representation-finite algebra, thereby proving the conjecture for the original by transitively using known cases ([arxiv.org](https://arxiv.org/abs/2506.23747#:~:text=2025,bound%20quiver%20algebras%2C%20and%20show)). These reduction techniques are promising: they aim to show that any would-be counterexample could be peeled away to a simpler core – a core which empirical evidence suggests likely doesn’t exist.\n\n- **Computational and Model-Theoretic Methods:** On another front, some researchers have used computational algebra systems to calculate projective dimensions for random algebras or specific families, searching for patterns or potential counterexamples. So far, these experiments have supported the conjecture by failing to find unbounded behavior in finite modules. Additionally, methods from **model theory** (e.g. the Ziegler spectrum of modules) have been applied. Krause (1998) connected finitistic dimension to properties of the category of *pure-injective* modules ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=emphasis%20on%20fields%2C%20rings%2C%20modules%2C,of%20algebras%20by%20dominant%20dimension)), and others have considered whether infinite length modules that witness large projective dimensions must appear as logical limits of finite ones. While abstract, these approaches can sometimes rephrase the conjecture in terms of the absence of certain types of module-theoretic pathology, possibly making it more tractable with logical tools.\n\nIn summary, the attack on the finitistic dimension conjecture is multi-pronged. Some methods (explicit resolutions, syzygy manipulations) tackle the problem head-on by understanding resolutions module by module. Others (derived categories, Auslander’s conjecture) reframe it in a larger context, hoping to leverage deeper structural theorems. And yet others (reduction techniques, computational checks) aim to cut the giant down to size or at least provide evidence of its truth. The diversity of techniques also means that the conjecture has inspired development of several independent theories – each valuable in its own right – such as Igusa–Todorov theory, Auslander–Igusa theory of subcategories, and connections to triangulated category generation. \n\n# Latest Progress and Outlook\nThe last few years have seen continued activity. While a complete proof remains elusive, researchers have tightened the net of partial results and drawn surprising connections to other conjectures:\n\n- **Symmetry and Higher Structures:** It has been observed that finiteness of finitistic dimension is related to a symmetry property in homological algebra. Recent work (Ruoyu Guo, 2024) studies a conjectured symmetry of certain *derived invariants* (called “derived delooping levels”) and shows it is closely linked to the finitistic dimension conjecture ([arxiv.org](https://arxiv.org/abs/2406.00253#:~:text=2024,extends%20to%20one%20of%20its)). This kind of work suggests that proving FDC might require proving an even more general statement about the structure of derived categories or Ext-algebras, thereby linking it with other famous conjectures (for example, the *Hochschild cohomology symmetry conjecture*).\n\n- **New Reduction Approaches:** In 2023, MacQuarrie and Naves showed that in certain *quotient extensions* $B\\subseteq A$ (where $A$ is built from $B$ with additional radical layers), one can relate $\\operatorname{fin.dim}A$ to $\\operatorname{fin.dim}B$ ([arxiv.org](https://arxiv.org/abs/2306.02539#:~:text=2023,algebras%20such%20that%20the%20projective)). Their results continue a theme of “breaking down” the problem: if one proves it for a base algebra $B$, it holds for a larger algebra $A$ constructed in controlled ways from $B$. This incremental approach is narrowing the types of algebras one must ultimately prove the conjecture for.\n\n- **Monomial Techniques Generalized:** The idea of simplifying algebras via arrow removal ([arxiv.org](https://arxiv.org/abs/2506.23747#:~:text=2025,bound%20quiver%20algebras%2C%20and%20show)) (mentioned above) is quite new (2025) and offers a systematic way to reduce to monomial algebras. Since monomial algebras are known to satisfy FDC, this is a promising route. The strategy is to show that any finite-dimensional algebra can be transformed, through a finite sequence of “monomial mutations,” into a monomial algebra without introducing infinite $\\mathrm{pd}$ in the process. Early results show this works for certain classes of quivers. If it can be fully generalized, it would essentially solve the conjecture by reduction. \n\n- **Exploring Specific Algebra Families:** Researchers are also homing in on specific families of potential counterexamples. One focus has been on **quotient of polynomial algebras** (or quiver algebras) by *quadratic relations*. These are algebras defined by homogeneous relations of degree 2. Such algebras include *Koszul algebras* and others that are better understood. A question asked on MathOverflow was whether *quadratic algebras* could violate FDC – preliminary evidence suggests they do not, and many have finite finitistic dimension due to their grading and Koszul properties. Another family under scrutiny is **group algebras** of infinite groups: while group algebras are not artinian unless the group is finite, one can consider artinian quotients or blocks. No issues have been found here either, aligning with known group cohomology patterns.\n\n- **Connections to $K$-theory and Others:** Interestingly, the conjecture has even made appearances in adjacent fields. Some results in algebraic $K$-theory (relating to the vanishing of higher Hochschild homology) assume finiteness of finitistic dimension as a condition. This cross-pollination means progress on FDC could impact results in algebraic geometry and topology that use homological dimensions as hypotheses.\n\n**Outlook:** As of the current date, the finitistic dimension conjecture remains open, but optimism persists. The steady accumulation of positive results in special cases, and the failure to find any counterexample, suggest that a proof (or a very deep counterexample) might emerge in the coming years. The problem has already led to rich developments in representation theory and homological algebra. Even if the conjecture were somehow false, the structure of a counterexample would itself be extremely enlightening (it would likely be a very wild algebra with exotic module behavior). In the more expected event that the conjecture is true, the proof will likely synthesize many of the techniques mentioned – combining explicit module-theoretic control with higher-level categorical reasoning. In any case, the pursuit of this conjecture continues to be a driving force in modern algebra, inspiring new ideas and connecting disparate areas of mathematics.\n\n# Bibliography (Key References with Annotations)\n\n1. **Hyman Bass (1960).** *“Finitistic Dimension and a Homological Generalization of Semi-Primary Rings,”* **Trans. Amer. Math. Soc. 95** (1960), 466–488. ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=,algebra%2C%20Princeton%20University%20Press%2C%201956)) **Annotation:** This foundational paper introduced the concept of finitistic dimension. Bass proved fundamental results in the commutative case (showing the finiteness of finitistic dimension for Noetherian rings, relating it to Krull dimension ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=the%20projective%20dimension%20of%20M%2C,Generalized%20Nakayama%20conjecture%20For))) and raised the question for general Artinian rings. It set the stage for all subsequent work on the conjecture.\n\n2. **Birge Zimmermann-Huisgen (1992).** *“Homological domino effects and the first finitistic dimension conjecture,”* **Invent. Math. 108** (1992), 369–383. ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=rings%2C%20Notes%20by%20Claus%20Michael,383)) **Annotation:** A seminal work that investigates the mechanism by which finite projective dimensions can propagate to larger and larger modules (*domino effects*). Zimmermann-Huisgen provided deep insight into why the *big* finitistic dimension can differ from the little one, constructing chains of modules with increasing $\\mathrm{pd}$. Her methods introduced new techniques to produce or prevent unbounded resolutions, influencing much later research.\n\n3. **E. L. Green, E. Kirkman, J. Kuzmanovich (1991).** *“Finitistic dimensions of finite-dimensional monomial algebras,”* **J. Algebra 136** (1991), 37–50. ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=conjecture%20was%20proved%20for%20monomial,pairs%27%27%20given%20by%20certain%20maps)) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=,50)) **Annotation:** This paper proved the conjecture for monomial algebras, a broad class with combinatorial structure. The authors explicitly constructed projective resolutions for simple modules using combinatorial data from the quiver and relations, and they derived a uniform bound on resolution lengths. The result was one of the first general proofs of FDC for a non-trivial family of wild algebras, lending credence to the conjecture’s truth.\n\n4. **Jeremy Rickard (2019).** *“Unbounded derived categories and the finitistic dimension conjecture,”* **Adv. Math. 354** (2019), 106735 (21 pages). ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=Institutt%20for%20matematiske%20fag%20Summer,parallel%20theories%20of%20cohomology%20were)) **Annotation:** In this modern approach, Rickard reframes the finitistic dimension conjecture in terms of derived categories and triangulated generation. He shows that finiteness of fin.dim is equivalent to a certain generation condition in the unbounded derived category of $A$. This paper opened a new avenue of attack by linking the conjecture to big structures in homological algebra, and it has inspired further work on derived invariants related to FDC.\n\n5. **Chengxi Wang and Changchang Xi (2017).** *“Finitistic dimension conjecture and radical-power extensions,”* **J. Pure Appl. Algebra 221** (2017), 832–846. ([www.sciencedirect.com](https://www.sciencedirect.com/science/article/abs/pii/S0022404916301293#:~:text=The%20finitistic%20dimension%20conjecture%20asserts,If%20the%20extension%20is%20right)) **Annotation:** This is one of a series of papers by Xi and collaborators aimed at reducing the general conjecture to more manageable subproblems. In this work, they show that if one can solve the conjecture for certain extension algebras (where one algebra’s radical-power ideal sits in another algebra), then one obtains a solution for all algebras. Essentially, they prove the conjecture is “reduction closed” under a class of extensions, thereby significantly narrowing the search for a proof. This paper exemplifies the use of induction and reduction techniques that have become central in recent progress.\n\n6. **S. O. Smalø (1998).** *“The supremum of the difference between the big and little finitistic dimensions is infinite,”* **Proc. Amer. Math. Soc. 126** (1998), 2619–2622. ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=,2622)) **Annotation:** A short but impactful paper, Smalø constructs examples of Artin algebras that separate the big and little finitistic dimensions as much as desired. This provided a clear refutation of the earlier “first” finitistic dimension conjecture and highlighted the subtlety of the “little” conjecture. Smalø’s construction techniques (based on clever module constructions) have informed how algebraists think about potential extremal behavior in homological dimensions.\n\n7. **Birge Huisgen-Zimmermann & Søren O. Smalø (1991).** *“Finitistic dimension of Artinian rings with vanishing radical cube,”* **Math. Z. 206** (1991), 505–526. ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=finite,526)) **Annotation:** In this paper (often cited as Green–Zimmermann, 1991, since the first author E. Green’s contributions are incorporated in related work), the authors prove FDC for the class of algebras with $J^3=0$. They develop techniques to handle algebras with small radical lengths, using both combinatorial and Homological algebra arguments. This result was a significant step beyond the monomial case and introduced methods (like “parallel splitting” of projectives) that proved useful in later generalizations.\n\n8. **Kiyoshi Igusa & Gordana Todorov (2005).** *“On the finitistic global dimension conjecture for Artin algebras,”* unpublished preprint, 2005; see also later works culminating in Eric Hanson & K. Igusa (2019) ([arxiv.org](https://arxiv.org/abs/1911.00614#:~:text=2019,an%20Artin%20algebra%2C%20now%20known)). **Annotation:** Igusa and Todorov’s series of works (mid-2000s) introduced the $\\phi$-dimension and related invariants, developing an influential framework now called *Igusa-Todorov theory*. While the 2005 preprint itself remained unpublished, its ideas were disseminated in conferences and later papers. The approach provided new upper bounds for $\\operatorname{fin.dim}A$ and showed that many algebras have fin.dim bounded by functions of more accessible invariants. The culmination was the *$\\phi$-dimension conjecture* (that $\\phi$-dim = fin.dim), which was disproven in 2019 ([arxiv.org](https://arxiv.org/abs/1911.00614#:~:text=2019,an%20Artin%20algebra%2C%20now%20known)). Nonetheless, the techniques (e.g. the Igusa-Todorov function, and the concept of “IT-algebras”) continue to be key tools in current research on the conjecture.\n\n9. **Øyvind Solberg (2001, ed.).** *“Homological Conjectures for Finite Dimensional Algebras – Summer School Lecture Notes,”* NTNU, 2001. ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=variety,k%29%20is%20the%20usual)) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=The%20little%20finitistic%20dimension%20being,the%20Nunke%20condition%2C%20which%20in)) **Annotation:** These are lecture notes from a summer school that surveyed the status of various homological conjectures (including FDC) as of 2001. They provide a comprehensive overview of known implications between conjectures, partial results, and techniques (with an extensive bibliography) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=situation%20there%20are%20conjectures%20which,most%20general%20one%2C%20and%20it)) ([oyvinso.folk.ntnu.no](https://oyvinso.folk.ntnu.no/Nordfjordeid/History/homconjsubject.html#:~:text=The%20little%20finitistic%20dimension%20being,the%20Nunke%20condition%2C%20which%20in)). While not a research paper per se, this reference is invaluable for historical context and as a roadmap to the literature up to that point. It’s often cited for background and for the clear exposition of how FDC relates to other conjectures like Nunke’s condition and Nakayama’s conjecture.\n\n10. **Karin Erdmann, Odysseas Giatagantzidis, Chrysostomos Psaroudakis, Øyvind Solberg (2025).** *“Monomial arrow removal and the finitistic dimension conjecture,”* preprint (arXiv 2025). ([arxiv.org](https://arxiv.org/abs/2506.23747#:~:text=2025,bound%20quiver%20algebras%2C%20and%20show)) **Annotation:** A very recent paper that introduces a novel technique to simplify algebras while preserving finitistic dimension properties. By systematically removing arrows from quivers and adjusting relations (whenever an arrow is proven “redundant” for homological purposes), the authors reduce algebras to monomial ones. This paper is on the cutting edge of current research; its methods have the potential to settle new cases of the conjecture or even lead to a general proof. It also showcases the continued relevance of combinatorial methods in tackling this deep homological problem.\n\n"
  }
]